function Dsy()

{
	
	this.Items=
	{
		
	};	
	
}
Dsy.prototype.add=function (id,iArray)

{
	
	this.Items[id]=iArray;	
	
}
Dsy.prototype.Exists=function (id)

{
	
	if(typeof (this.Items[id])=="undefined")return false;	
	return true;	
	
}
function change(v,cat1,cat2,cat3)
{
	
	var j=0;	
	var str="0";	
	for(i=0;i<v;i++)
	{
		if(s[i]=="s1")str+="_"+document.getElementById(s[i]).value;
		else if(s[i]=="s2"){
			str+="_"+document.getElementById(s[i]).value.substr(2, 2);
		}
		
	};	
	var ss=document.getElementById(s[v]);	
	with(ss)
	{
		
		length=0;		
		options[0]=new Option(opt0[v],opt0[v]);		
		
		if(typeof (opt1)=="undefined")
		{
			
			
			
		}else 
		{
			
			var ss;			
			var currentdata;			
			currentdata=opt1[v];			
			ss=currentdata.split("*");			
			options[0]=Option(ss[1],ss[0]);			
			
		}
		
		if(v&&document.getElementById(s[v-1]).selectedIndex>0||!v)
		
		{
			
			if(dsy.Exists(str))
			{
				
				var ss;				
				var currentdata;				
				ar=dsy.Items[str];				
				for(i=0;i<ar.length;i++)
				{
					
					currentdata=ar[i];					
					ss=currentdata.split("*");					
					options[length]=new Option(ss[1],ss[0]);					
					
					if(cat1==ss[0]||cat2==ss[0]||cat3==ss[0])
					{
						
						j++;						
						if(j<2)
						{
							
							options[i+1].selected=true;							
							
						}
						
						
					}
					// if(v)options[1].selected = true;
					//ss=arr.split("*")
					
				}
				
			}
			
		}
		if(++v<s.length)
		{
			change(v,cat1,cat2,cat3);
			
		}
		
	}
	
}





var arrprodu1=new Array;

arrprodu1[0]=["10*污水处理设备","20*原水处理设备","30*除尘器/空气净化/洁净室设备","40*环卫及清洁设备","41*园林机械与景观设备","42*农业机械","50*环保仪器仪表","51*工控设备","52*包装/印刷设备","60*环保材料","61*精细化学品","70*其它环保设备","71*矿冶设备","72*工程机械","73*冶金矿产","74*物流/仓储设备","75*塑料及行业设备","80*节能新能源","85*通用五金","86*暖通/空调/制冷设备","87*橡塑制品","88*五金工具","89*安防设备","90*通用机械","93*制药设备","95*食品设备","98*环保工程","99*商务服务/环保服务"];
arrprodu1["0_10"]=["1010*固液分离设备","1020*曝气器/曝气机","1030*污泥收集、污泥浓缩设备","1050*生物处理设备","1060*加药反应设备","1070*城市污水处理","1080*高浓度有机废水处理"];

arrprodu1["0_10_10"]=["101001*滗水器","101002*沉淀池","101003*气浮","101004*除砂器","101005*砂水分离器","101006*离心机/卧螺离心机","101007*油水分离器","101008*污泥脱水机","101009*压滤机","101010*板框压滤机","101011*带式压滤机","101012*化粪池","101013*溶气释放器/气浮释放器","101014*厢式压滤机","101015*滤池","101016*集水槽/储水槽","101017*污泥切割机/污泥破碎机","1010*其它固液分离设备"];
arrprodu1["0_10_20"]=["102001*微孔曝气器","102002*曝气头","102003*曝气盘","102004*曝气软管","102005*射流器/水射器","1020*其它曝气器"];
arrprodu1["0_10_30"]=["103001*刮泥机","103002*吸泥机","103003*机械格栅","103004*玻璃钢格栅","103005*螺旋输送机","103006*污泥浓缩脱水一体机","103007*土工格栅","1030*其它污泥收集、污泥浓缩设备"];
arrprodu1["0_10_50"]=["105001*SBR法设备","105002*USB厌氧设备","1050*其它生物处理设备"];
arrprodu1["0_10_60"]=["106001*加药设备","106002*搅拌机","106003*混合器","106004*加药泵","1060*其它加药反应设备"];
arrprodu1["0_10_70"]=["107001*生活污水处理设备","107002*污水提升器","1070*其它城市污水处理设备"];
arrprodu1["0_10_80"]=["1080*高浓度有机废水处理"];

arrprodu1["0_20"]=["2010*纯水设备","2020*软化水设备/软水器","2030*海水淡化设备","2040*生活饮用水处理设备","2050*泳池水处理设备","2070*供水设备","2080*中水回用","2090*杀菌消毒设备"];
arrprodu1["0_20_10"]=["201001*高纯水制取","201002*反渗透","201003*电渗析","201004*离子交换器","201005*超滤","201006*微滤","201007*膜组件","201008*纳滤","2010*其它纯水设备"];
arrprodu1["0_20_20"]=["202001*除盐","202002*除氧设备","202003*除垢设备","202004*除铁除锰","2020*其它软化水设备/软水器"];
arrprodu1["0_20_30"]=["2030*海水淡化设备"];
arrprodu1["0_20_40"]=["204001*家用净水器","204002*家用纯水机","204003*矿泉水设备","204004*直饮机","204005*开水器/开水炉","204006*一体化净水器","2040*其它生活饮用水处理设备"];
arrprodu1["0_20_50"]=["205001*循环水设备","205002*过滤系统","205003*毛发聚集器","205004*池塘吸泥/池塘吸污","2050*其它泳池水处理设备"];
arrprodu1["0_20_70"]=["207001*气压供水设备","207002*变频供水设备","207003*售水机","2070*其它供水设备"];
arrprodu1["0_20_80"]=["2080*其它中水回用"];
arrprodu1["0_20_90"]=["209001*二氧化氯发生器","209002*臭氧发生器","209003*紫外线杀菌","209004*次氯酸钠发生器","209005*加氯机","209006*臭氧消毒机/柜","209007*紫外线消毒设备","209009*微波消毒设备","209010*煮沸消毒器/煮沸消毒锅","209011*蒸汽消毒锅/机","209012*洗碗机","209013*水浴杀菌锅/水浴灭菌器","209014*杀菌锅/高温灭菌锅","209015*巴氏杀菌机/巴氏杀菌设备","209016*牛奶灭菌/牛奶杀菌设备","209017*空气消毒设备","209018*中央空调消毒设备","209019*光触媒设备","209020*医用消毒设备","209021*食品杀菌设备","2090*其它杀菌消毒设备"];

arrprodu1["0_30"]=["3010*除尘器","3020*脱硫设备","3030*除尘配件","3040*废气净化","3050*空气净化器","3060*洁净设备","3061*防静电设备"];
arrprodu1["0_30_10"]=["301001*静电除尘器","301002*布袋除尘器/脉冲除尘器","301003*旋风除尘器","301004*滤筒除尘器","301005*湿式除尘器","301006*脱硫除尘器","301007*单机除尘器","301008*塑烧板(烧结板)除尘器","301009*移动式除尘器","301010*水膜脱硫除尘/花岗岩水膜脱硫除尘器","301011*多管脱硫除尘器","301012*集尘器/集尘机","301013*中央集尘系统","301014*仓顶除尘器","3010*其它除尘器"];
arrprodu1["0_30_20"]=["302001*脱硫磨粉机","302002*脱硫塔","3020*其它脱硫设备"];
arrprodu1["0_30_30"]=["303001*布袋","303002*骨架","303004*卸料器/卸灰阀","303005*脉冲控制仪","303006*吊挂装置","303007*喷头","303008*喷嘴","303009*阳极板","303010*阴极线","303012*文氏管/文丘里管","303013*粉尘滤芯","303014*加湿搅拌机/粉尘加湿卸灰机","303015*电站输灰设备/气力输灰机","303017*振动筛","303018*除渣器/除渣机","303019*上料机","303020*吸气臂","303021*地垫/除尘地垫","3030*其它除尘配件"];
arrprodu1["0_30_40"]=["304001*油烟净化器","304002*酸雾净化器","304003*尾气处理装置","304004*等离子除臭设备","304005*废气吸附装置","304006*焊烟净化","304007*抽油烟机/下排净化抽油烟机","304008*油雾收集器/油雾净化器","304009*酸雾净化塔/酸雾吸收塔","304010*漆雾净化器/漆雾过滤机","304011*泄氯/漏氯吸收装置","304012*有机废气治理","304013*除臭机","304014*除臭剂","3040*其它废气净化"];
arrprodu1["0_30_50"]=["305001*自净器","305002*加湿机/加湿器","305003*除湿机","3050*其它空气净化器"];
arrprodu1["0_30_60"]=["306001*洁净工作台","306002*空气过滤器","306003*传递窗","306004*风淋室","306005*层流罩","306006*送风口","306007*称量室","306008*离子风枪","306009*净化工程","306010*采样车/取样车","306011*层流车","306012*彩钢板","306013*散流器/散流板","306014*FFU","306015*风淋室控制器","306016*手消毒器","306017*安全柜/生物安全柜","3060*其它洁净设备"];
arrprodu1["0_30_61"]=["306101*无尘纸/无尘布","306102*防静电服及配件","306103*防静电鞋","306104*防静电手套","306105*防静电垫","306106*防静电帘","306107*防静电椅","306108*防静电刷","3061*其它防静电设备"];

arrprodu1["0_40"]=["4010*环卫车辆","4015*专用汽车","4020*垃圾桶","4030*垃圾处理","4031*垃圾填埋","4040*环保厕所","4050*清洗清洁设备","4051*洗车设备","4055*洗涤设备/整熨设备","4060*清洁用品","4070*卫生防疫"];
arrprodu1["0_40_10"]=["401001*垃圾车","401002*保洁车","401003*洒水车","401004*吸粪车/吸污车","401006*清扫车","4010*其它环卫车辆"];
arrprodu1["0_40_15"]=["401501*观光车","401502*消防车/救火车","401503*高空作业车","401504*道路清障车/拖车","401507*挂车","401508*半挂牵引车","401509*货车/卡车","401510*液罐车","401511*救险车","401512*救护车","4015*其它专用汽车"];
arrprodu1["0_40_20"]=["402001*分类垃圾桶","402002*不锈钢垃圾桶","402003*木条垃圾桶","402004*塑料垃圾桶","402005*垃圾房","4020*其它垃圾桶"];
arrprodu1["0_40_30"]=["403001*垃圾中转站","403002*垃圾除臭","403003*焚烧炉","403008*垃圾压缩","403009*垃圾分选机","403010*垃圾处理机/垃圾处理器","403011*垃圾破碎机","403012*生物质粉碎机/生物质破碎机","403013*移动破碎站","403014*堆肥设备","403015*危险废物处置设备","403016*湿化机/禽畜无害化处理设备","4030*其它垃圾处理"];
arrprodu1["0_40_31"]=["403101*环卫推土机","403102*垃圾压实机","403103*垃圾填埋防渗材料","4031*其它垃圾填埋设备"];
arrprodu1["0_40_40"]=["404001*移动厕所","404002*节水厕所","404003*生态厕所","404004*厕所租赁","4040*其它环保厕所"];
arrprodu1["0_40_50"]=["405001*洗地机/擦地机","405002*高压水枪","405003*高压清洗","405004*超声波清洗","405005*工业吸尘器","405006*扫雪车,除雪设备","405007*打蜡机","405008*晶面机/石材翻新机","405009*洗桶机/洗瓶机/刷桶机/刷瓶机","405010*垃圾收集器","405011*垃圾捡拾器","405012*扫地机","405013*等离子清洗机","405014*管道疏通机/管道疏通器","405015*蒸汽清洗机","405016*冷凝器在线清洗设备","4050*其它清洗清洁设备"];
arrprodu1["0_40_51"]=["405101*洗车机/洗车器","4051*其他洗车设备"];
arrprodu1["0_40_55"]=["405501*干洗机","405502*工业商用洗衣机/工业洗衣机","405503*水洗机","405504*洗脱两用机","405505*烫平机","405506*整熨设备","405507*洗涤脱水机","405508*干衣机","4055*其它洗涤设备/整熨设备"];
arrprodu1["0_40_60"]=["406001*干手器/烘手器","406002*喷香机/飘香机","406003*皂液器/给皂机","406004*纸架","406005*大卷纸/擦手纸","406006*尘推/地拖","406007*拖把","406008*扫把/扫帚","406009*洗地刷,地板刷","406010*清洁剂/清洗剂","406011*地板蜡","406012*告示牌/指示牌","406013*清洁球","406014*环保袋","4060*其它清洁用品"];
arrprodu1["0_40_70"]=["407001*喷雾器","4070*其他卫生防疫设备"];

arrprodu1["0_41"]=["4110*割灌修剪","4111*园林用具","4112*植保机械","4113*排灌机械","4120*户外家具","4121*景观材料","4123*景观与园林小品","4130*耕整机械","4131*种子机械","4132*种植播种"];
arrprodu1["0_41_10"]=["411001*割草机","411002*草坪机","411003*草坪车","411004*梳草机","411005*修剪机","411006*油锯","4110*其他割灌修剪设备"];
arrprodu1["0_41_11"]=["411101*锄","411102*耙","411103*锹/铲","411104*剪刀","411105*手锯","411106*镰刀","411107*吸叶机","411108*钢镐","411109*叉","4111*其它园林用具"];
arrprodu1["0_41_12"]=["411201*打药机","411202*喷药车","411203*喷雾机","411204*施肥机/施肥器","411205*温室大棚","411206*卷帘机/大棚卷帘机","411207*植物补光灯","4112*其它植保机械"];
arrprodu1["0_41_13"]=["411301*喷灌机","4113*其它排灌机械"];
arrprodu1["0_41_20"]=["412001*公园椅","412002*长椅","412003*凳","412004*休闲桌","412005*太阳伞","412006*秋千","4120*其它户外家具"];
arrprodu1["0_41_21"]=["412101*木塑","412102*防腐木","412103*阻燃木材/防火木材","412104*压花/压模/压印地坪","412105*花架","412107*花盆","412108*遮阳网","412109*钢结构/膜结构","412110*草坪","412111*人造草坪","4121*其它景观材料"];
arrprodu1["0_41_23"]=["412301*水景/人工瀑布/水幕","412302*喷泉","412303*人造雾","412304*亭","412305*园林雕塑/园林浮雕","412306*假山","412307*园林石","412308*园林装饰配件","4123*其它园林景观与园林小品"];
arrprodu1["0_41_30"]=["413001*地钻","413002*松土机","413003*挖坑机","413004*开沟机","413005*平地机","413006*起垄机","413007*中耕机","413008*旋耕机","413009*微耕机","413010*翻转犁","413011*培土机","413012*田园管理机/万能管理机","413013*葡萄埋藤机","4130*其它耕整机/耕整机械"];
arrprodu1["0_41_31"]=["413101*种子清选机","413102*去石机","413103*种子精选机","413104*种子包衣机","4131*其它种子机械"];
arrprodu1["0_41_32"]=["413201*种植机","413202*撒播机","413203*条播机","413204*穴播机","413205*培土机","413206*移栽机/移植机","413207*起苗机","413208*栽植机","413209*地膜机","413210*残膜回收机","413211*插秧机","413212*抛秧机","4132*其它种植播种"];

arrprodu1["0_42"]=["4210*拖拉机","4220*收获机械","4230*饲料加工设备","4240*棉花机械","4250*木材加工机械","4260*畜牧机械","4270*渔业机械"];
arrprodu1["0_42_10"]=["421001*手扶拖拉机","421002*轮式拖拉机","421003*履带式拖拉机/链轨拖拉机","4210*其它拖拉机"];
arrprodu1["0_42_20"]=["422001*收割机","422002*收获机","422003*脱粒机","422004*打捆机","422005*摘果机","422006*扬谷机","4220*其它收获机械"];
arrprodu1["0_42_30"]=["423001*饲料颗粒机","423002*饲料粉碎机","423003*饲料混合机","423004*饲料搅拌机","423005*饲料压块机","423006*铡草机","4230*其它饲料加工设备"];
arrprodu1["0_42_40"]=["424001*采棉机/摘棉机/拾棉机","424002*清弹机","424003*梳理机","424004*弹花机","424005*轧花机","424007*棉花打包机","4240*其它棉花机械"];
arrprodu1["0_42_50"]=["425001*木材去皮机/木材剥皮机","425002*木材切片机/木材削片机","425003*木炭机","425004*制棒机","425005*筷子机","425006*树枝粉碎机","425007*拼板机","425008*旋切机","4250*其它木材加工机械"];
arrprodu1["0_42_60"]=["426001*饲喂设备","426002*笼具","426003*清粪机/车","426004*繁殖器具","426005*孵化设备","4260*其它畜牧机械"];
arrprodu1["0_42_70"]=["427001*增氧机","427002*投饵机","427003*网箱养殖设备","427004*织网机","427005*起网机","427006*塑料渔船","4270*其它渔业机械"];

arrprodu1["0_50"]=["5010*流体控制仪表","5020*水质分析仪","5030*空气及废气监测仪","5035*衡器","5040*应急监测仪器/便携/车载仪器","5050*辐射测量仪器","5055*光学仪器","5060*环境监测仪器","5061*噪声振动测量仪器","5070*环境试验仪器","5075*专用仪器仪表","5080*试验机,试验设备","5082*电子电工仪器仪表","5083*工控仪器仪表","5084*电磁兼容测试仪器/EMC","5085*压力仪表","5087*药物检测设备","5088*食品检测仪器","5090*生态仪器","5091*物性测试仪器","5092*通用仪器","5093*实验室仪器","5094*质量检测","5095*实验耗材,实验室耗材","5096*实验试剂","5097*量具"];
arrprodu1["0_50_10"]=["501001*流量计","501002*液位计","501003*水位控制","501004*电导率仪","501005*盐度计","501006*PH计","501007*酸碱度/氧化还原控制器","501008*浊度计/浊度仪","501010*温度计/温度仪","501011*压力开关/压力变送器","501012*定量配料系统/自动配料系统","501013*灌装机,液体灌装机,定量灌装机","501015*视镜","501016*料位计","501019*流量开关","501020*液位开关","501022*气缸","501024*执行器","501025*回流比控制器","501026*回流头","501027*阀门定位器","501028*水表","501029*浮球液位控制器","5010*其它流体控制仪表"];
arrprodu1["0_50_20"]=["502001*COD测定仪","502002*水质采样器","502003*水质自动监测系统","502004*多参数水质检测仪","502005*BOD测定仪","502006*离子检测仪","502007*余氯、总氯测定仪","502009*溶氧仪/溶解氧测定仪","502011*TOC测定仪/总有机碳测定仪","502012*气体稀释器","502013*总氮测定仪","502014*氨氮测定仪","502015*氰化物测定仪","502016*色度仪","502017*总磷测定仪","502018*污泥分析仪/污泥界面分析仪","502019*水质测试盒/试剂盒","502020*重金属在线监测仪","502021*测油仪","502022*污泥浓度计","502023*藻类计数仪","502024*COD恒温加热器/COD消解加热器","5020*其它水质分析仪"];
arrprodu1["0_50_30"]=["503001*粉尘测定仪","503002*粉尘采样器","503003*大气颗粒物浓度监测仪","503004*汽车尾气分析仪","503005*烟气监测","503006*烟气分析仪","503007*甲醛检测仪/甲醛分析仪","503008*氧含量/微量氧分析仪","503009*臭氧分析仪","503010*二氧化碳分析仪","503011*测氨仪","503012*气体稀释仪","503013*酸雨采样器","503014*一氧化碳检测","503015*二氧化氯分析","503016*氢气分析仪","503017*硫化氢检测仪","503018*烟度计","503019*酒精检测仪","503020*PM2.5检测仪/PM2.5监测仪","503021*尘埃粒子计数器","503022*气溶胶发生器","503023*大气采样仪","503024*气体采样袋","5030*其它空气及废气监测仪"];
arrprodu1["0_50_35"]=["503501*电子秤","503502*台秤","503503*计价秤","503504*定量秤","503505*吊秤","503506*配料秤","503507*地磅/汽车衡","503508*皮带秤","5035*其它衡器"];
arrprodu1["0_50_40"]=["504001*气相色谱仪","504002*TVOC、有毒有害气体监测仪","504003*气体泄漏报警装置","504004*便携式分光光度计","504005*便携式光谱仪","504006*GPS定位仪","504007*四轮定位仪","504008*激光定位仪","5040*其它应急监测仪器/便携/车载仪器"];
arrprodu1["0_50_50"]=["505001*测氡仪","505002*射线分析仪","505003*场强仪","505004*高斯计/特斯拉计","5050*其它辐射测量仪器"];
arrprodu1["0_50_55"]=["505501*放大镜","505502*显微镜","505503*棱镜/透镜","505504*望远镜","505505*目镜/物镜","505506*滤光片/滤色片","505507*激光器","505508*激光水平仪","505509*激光测距仪","505510*垂准仪","505511*经纬仪/水准仪","505512*干涉仪","505513*影像仪","505514*夜视仪","505515*三维扫描仪","505516*光学检测仪","5055*其它光学仪器"];
arrprodu1["0_50_60"]=["506001*声级计/噪音计","506002*光纤次声传感器","506003*风速风向仪/风压计/风量计","506005*微生物采样器","506006*空气负离子检测仪","506007*红外热像仪","506008*红外测温仪","506009*测振仪/振动测量仪","506010*照度计","5060*其它环境监测仪器"];
arrprodu1["0_50_61"]=["506101*声级校准器","506103*音频分析仪","506104*声学传感器","506105*振动计","506106*振动分析仪","506107*振动校准仪","5061*其它噪声振动测量仪器"];
arrprodu1["0_50_70"]=["507001*高低温试验箱","507002*恒温恒湿试验箱","507003*盐雾试验箱","507004*腐蚀试验箱","507005*老化箱","507006*湿热试验箱","507007*养护箱","507008*沙尘试验箱/砂尘试验箱","507009*淋水试验箱/淋雨试验箱","5070*其它环境试验仪器"];
arrprodu1["0_50_75"]=["507501*静电测试仪","507502*电火花检测仪/电火花检漏仪","507503*造纸检测仪/挺度仪","507504*沥青试验仪器/脆点仪","507505*硫化仪","507506*制样机/橡塑专用仪器","507507*力矩限制器","507508*金属探测仪","507509*矿业物探仪器","507510*地震仪","507511*找水仪","507512*B超/B超诊断仪/B型超声检查","507513*回声测深仪","507514*土工合成材料垂直渗透仪/土工布透水性测定仪","507515*监护仪","507516*振动时效仪","507517*水文仪器","507518*凝点测定仪","5075*其它专用仪器仪表"];
arrprodu1["0_50_80"]=["508001*硬度计","508002*拉力试验机/拉力机","508003*熔点仪","508004*压力试验机","508005*振动试验机","508006*弯曲试验机","508007*扭转试验机","508008*冲击试验机","508009*疲劳试验机","508010*耐磨试验机","508011*强度试验机","508012*万能试验机","508013*跌落试验机","508014*非金属材料试验机","508015*平衡机","508016*工艺试验机","508017*材料试验机","508018*力与变形检测仪","508019*包装件试验机","508020*汽车试验设备","508021*风机性能试验台","508022*测功机/测功器","508023*灼热丝试验仪","508024*针焰试验仪","508025*熔融指数仪","508026*漏电起痕试验仪","508027*电缆切片机/电缆刨片机/电缆削片机","508028*摩擦系数仪","5080*其它试验机/试验设备"];
arrprodu1["0_50_82"]=["508201*万用表","508202*电力计","508203*LCR测试仪/LCR测量仪","508204*电参数综合测量仪","508205*钳型表","508206*功率表/功率计","508207*电能表","508208*电容表","508209*电流/电压表","508210*电阻测试仪/绝缘测试仪","508211*示波器","508212*电池测试仪","508214*分流器","508215*开关测试仪","508216*继电保护测试仪","508223*电路测试仪","508224*信号发生器","508225*润滑油分析仪/油质检测仪","508227*电抗器","508228*元器件参数测试仪","5082*其它电子电工仪器仪表"];
arrprodu1["0_50_83"]=["508301*网络分析仪","508302*频谱分析仪","508303*逻辑分析仪","508304*温控器","508305*温度校验仪表","508306*巡检仪","508307*称重仪","508308*气体检测仪/气体检测设备","508309*记录仪","508310*配料秤","508311*电位计","508312*仪表箱","508313*信号隔离器/信号变送器","508314*PID调节仪","508315*时间频率计量标准器具","508316*计数器","5083*其它工控仪器仪表"];
arrprodu1["0_50_84"]=["508401*EMI传导噪声分析仪","508402*静电放电发生器","508403*雷击浪涌发生器/测试仪","508404*工频磁场发生器","508405*脉冲群发生器","508406*衰减振荡波发生器/振铃波发生器","508407*噪声模拟发生器","508408*周波跌落发生器","508409*组合式干扰发生器","5084*其它电磁兼容测试仪器/EMC"];
arrprodu1["0_50_85"]=["508501*压力表","508502*压力校验仪","508503*压力计","508504*压力控制器","508505*差压表","5085*其它压力仪表"];
arrprodu1["0_50_87"]=["508701*脆碎仪","508702*崩解仪","508703*冻力仪","508705*溶出度仪/溶出试验仪","508706*澄明度检测仪","5087*其它药物检测设备"];
arrprodu1["0_50_88"]=["508801*食品安全分析仪","508802*乳品分析仪","508803*蛋白质分析仪","508804*脂肪测定仪","508805*农药残留检测仪","508806*纤维测定仪","508807*色素快速分析仪","508808*谷物成份分析仪","508809*糖度仪/糖份计","508810*水活度检测仪/水活度分析仪","5088*其它食品检测仪器"];

arrprodu1["0_50_90"]=["509001*土壤测量/检测仪器","509002*植物测量仪器","509003*露点仪/湿度仪/微水仪","509004*温湿度记录仪/温湿度计/温湿度表","509005*照度计/光度计/亮度计","509006*气压表/气压计","509007*雨量计","509008*人工气候室/人工气候箱","509009*自动气象站","509010*生命探测仪/生命侦搜器","509011*水深仪/超声波水深仪","509012*流速仪","5090*其它生态仪器"];
arrprodu1["0_50_91"]=["509101*粒度仪","509102*电位仪","509103*粘度计/粘度仪","509104*流变仪","509105*密度仪/密度计/浓度计","509106*色差仪/色差计","509107*折光仪/折射仪","509108*旋光仪","509109*光度仪/光度计","509110*比色计/比色仪","509111*张力仪/表面张力计","509112*测厚仪/测厚规","509113*白度计/白度仪","509114*比表面积测定仪","509115*孔结构分析仪/孔径测定仪","509116*量热仪/热量计","509117*酶标仪/洗板机","509118*测力计/拉力计","509119*抗拔仪","509120*测速仪","5091*其它物性测试仪器"];
arrprodu1["0_50_92"]=["509201*色谱仪","509202*毛细管电泳","509203*进样器","509204*光谱仪","509205*质谱仪/质谱计","509207*元素分析仪","509208*碳硫分析仪","509209*定氮仪","509210*测汞仪","509211*硫氮分析仪","509212*流动分析仪","509213*热分析仪","509214*能谱仪","509215*电位滴定仪","509216*极谱仪","509217*库仑仪","509218*水份测定仪","509219*电化学分析仪/电化学工作站","509220*定硫仪","509221*测氢仪","5092*其它通用仪器"];
arrprodu1["0_50_93"]=["509301*实验室反应釜/反应器","509302*培养箱","509303*干燥箱/烘箱","509304*试管","509305*离心机","509306*振荡器","509307*搅拌器/搅拌压力桶","509308*移液器","509309*天平","509310*放大镜","509311*微量点滴仪","509312*金相仪/金相分析仪","509314*超声波破碎/超声波粉碎/超声波分散","509315*发酵罐","509316*滴定管","509317*教学仪器","509318*烧杯/烧瓶","509319*漏斗","509320*量筒/量杯","509321*坩埚","509322*扩增仪/PCR仪","509323*比重计","509324*通风橱/通风柜","509325*菌落计数器,菌落计数仪","509326*实验台/实验桌","5093*其它实验室设备/实验室仪器"];
arrprodu1["0_50_94"]=["509401*探伤仪","509402*对中仪/轴对中仪","509403*粗糙度仪/粗糙度计/表面光洁度","509404*气动量仪","509405*投影仪","509406*扩散氢测定/扩散氢测量","509407*频闪仪/转速计","509408*转速表/转速仪","509409*激光指向仪","509410*电缆故障/光纤故障","509411*卡尺","509412*真空度测量仪","509413*真空计","509414*真空检漏仪","509415*角度尺/测斜仪","509416*测高仪","509417*罗盘仪","509418*漏水检测仪","509419*膨胀率测定仪/膨胀系数测定仪","509420*通讯检测仪器","509421*测距仪","509422*钢筋位置测定仪/钢筋扫描仪","509423*裂缝仪","509424*定向仪","509425*测量光幕","5094*其它工件质量检测/工程测控"];
arrprodu1["0_50_95"]=["509501*PCR耗材","509502*冻存管/冷冻管","509503*离心管/离心瓶","509504*离心管架","509505*离心管盒/冻存盒","509506*染色缸/染色架","509507*巴氏吸管","509508*移液枪/移液管","509509*吸头/吸嘴/吸咀/枪头","509510*培养皿/培养板","509511*载玻片/盖玻片","509512*印迹膜","509513*试剂瓶/蓝盖瓶","509514*实验室滤纸","509515*色谱柱","5095*其它实验耗材"];
arrprodu1["0_50_96"]=["509601*通用试剂","509602*无机试剂","509603*有机试剂","509604*生化试剂","509605*分析试剂","509606*诊断试剂/临床检验试剂","509607*高纯试剂","5096*其它实验试剂"];
arrprodu1["0_50_97"]=["509701*量规","509702*建筑检测仪","509703*花岗岩量具","509704*电子尺/电阻尺","509705*游标卡尺","509706*带表卡尺/附表卡尺","509707*千分尺/螺旋测微器","509708*百分表","509709*千分表","509710*方箱","509711*平板","509712*测高仪","509713*高度计/高度尺","509714*偏摆仪","509715*角度尺/测斜仪","509716*深度尺","509717*卷尺","509718*比较仪","509719*对弧样板","509720*V型架","509721*测亩仪","509722*求积仪","509723*塞尺","509724*靠尺","509725*全站仪","509726*三坐标测量机","5097*其它量具"];

arrprodu1["0_51"]=["5111*控制元件","5112*现场总线","5120*自动化软件","5121*嵌入式系统","5122*人机界面","5123*控制系统","5124*PLC","5130*工业网络设备","5131*工控电脑产品","5132*显示屏","5140*变频器","5141*伺服系统","5150*电机","5151*机械传动","5159*电子制造设备","5160*电子元器件","5161*电源","5162*发电机组","5163*电池","5164*电极","5170*通用工业电器","5171*低压电器","5172*电气连接","5173*盘柜","5180*机器视觉","5181*远程测控","5182*传感器/探头","5183*变送器"];
arrprodu1["0_51_11"]=["511101*位置开关/行程开关/限位开关","511102*凸轮开关","511103*微动开关","511104*隔离开关","511105*负荷开关","511106*按钮开关","511107*接近开关","511108*光电开关/光电传感器","511109*安全开关","511110*主令控制器/主令开关","511111*显示单元","511112*指示灯","511113*报警装置","511114*手摇脉冲发生器/电子手轮","511115*电子硬盘/电子盘","511116*编码器","511117*复位开关/拉绳开关","511118*浮球开关","511119*感应开关","5111*其它控制元件"];
arrprodu1["0_51_12"]=["511201*总线电缆","511202*现场总线系统","511203*连接器","511204*总线模块","511205*接口模块","511206*智能I/O","511207*总线卡","511208*总线端子","5112*其它现场总线设备"];
arrprodu1["0_51_20"]=["512001*数据库软件","512002*测量软件","512003*测试软件","512004*SoftPLC/软逻辑","512005*监控软件","512006*CAM/计算机辅助制造","512007*管理软件","512008*组态软件/SCADA","512009*CAD/计算机辅助设计","5120*其它自动化软件"];
arrprodu1["0_51_21"]=["512101*嵌入式外围硬件设备","512102*嵌入式主板","512103*嵌入式控制器","512104*嵌入式计算机","512105*嵌入式开发工具","512106*嵌入式操作系统","512107*嵌入式机箱","512108*嵌入式处理器","512109*PC/104","5121*其它嵌入式系统设备"];
arrprodu1["0_51_22"]=["512201*平板监视器","512202*图控产品","512203*人机界面软件/HMI软件","512204*平板电脑/平板PC","512205*触摸屏/触控面板","5122*其它人机界面"];
arrprodu1["0_51_23"]=["512301*MRP","512302*管控一体化","512303*监控系统","512304*过程控制","512305*ERP","512306*DCS控制系统","512307*I/O控制","5123*其它控制系统"];
arrprodu1["0_51_24"]=["512401*PLC周边产品","512402*逻辑控制模块","512403*分布式控制系统","5124*其它PLC产品"];
arrprodu1["0_51_30"]=["513001*服务器","513002*防火墙","513003*交换机","513004*路由器","513005*集线器","513006*中继器","513007*电缆连接器/光纤连接器","513008*网卡","513009*网关","513010*网络机柜","513011*通信电缆","513012*信号转换器","513013*调制解调器","513014*光纤设备","513015*光缆","513016*配线箱/配线柜","5130*其它工业网络设备"];
arrprodu1["0_51_31"]=["513101*工控机/工业计算机","513102*图像采集","513103*通讯卡","513104*A/D D/A I/O卡","513105*特种计算机","513106*工业主板","513107*显示器","513108*工业机箱","513109*工业键盘","513110*工作站","513111*存储设备","513112*CPU","513113*数据采集系统/数据采集器","5131*其它工控电脑产品"];
arrprodu1["0_51_32"]=["513201*LED显示屏","513202*OLED显示屏","513203*LCD显示屏","5131*其它显示屏产品"];
arrprodu1["0_51_40"]=["514001*防爆变频器","514002*抽油机变频器","514003*卷绕专用变频器","514004*矿用变频器","514005*提升机专用变频器","514006*供水专用变频器","514007*注塑专用变频器","514008*纺织机专用变频器","514009*水泵专用变频器","514010*风机专用变频器","514011*电梯专用变频器","514012*空调专用变频器","514013*工程型变频器","514014*通用变频器","5140*其它变频器"];
arrprodu1["0_51_41"]=["514101*运动控制器","514102*直线电机","514103*同步电机","514104*数控系统","514105*运动控制卡","514106*伺服控制器","514107*伺服电机","514108*步进电机","5141*其它伺服系统"];
arrprodu1["0_51_50"]=["515001*直流电机","515002*交流电机","515003*减速电机","515004*变速电机","515005*刹车电机/制动电机","515006*变频电机","515007*油压电机","515008*力矩电机","515009*异步电机","515010*振动电机","515011*无刷电机","515012*防爆电机","515013*调速电机","515014*电机配件","5150*其它电机"];
arrprodu1["0_51_51"]=["515101*软启动器","515102*制动器","515103*联轴器","515104*离合器","515105*减速机","515106*变速机","515107*测速机","515108*丝杠","515109*滑轨","515110*传动带","515111*传动轮","515113*齿轮","515114*传动轴","515116*传动配件","515117*凸轮分割器/凸轮分度器","515118*蜗轮","515119*蜗杆","515120*链轮","515121*齿轮箱","5151*其它机械传动设备"];
arrprodu1["0_51_59"]=["515901*铆接机","515902*点胶机","515903*剪脚机","515904*剥线机","515905*绕线机/绞线机","515906*导线剥皮机","515907*跳线机","515908*充磁机","515909*邦定机","515910*贴片机","515911*蚀刻机","515912*端子机","515913*压接机","515914*热压机","515915*打胶机","515916*熔接机","515917*振动盘","515918*电子元件成型机","515919*电子电器生产线","515920*插片机/排片机","515921*插件机","5159*其它电子制造设备"];
arrprodu1["0_51_60"]=["516001*电阻","516002*PCB电路板","516003*控制器","516004*IGBT","516005*可控硅/晶闸管","516006*单片机","516007*防静电/保护器件","516008*电偶","516009*逆变器","516010*功率模块","516011*电容器","516012*电感器","516013*芯片","516014*电子管","516015*晶体管","516016*互感器","516017*蜂鸣器","516018*磁控管","5160*其它电子元器件"];
arrprodu1["0_51_61"]=["516101*变频电源","516102*直流电源","516103*开关电源","516104*应急电源/EPS电源","516105*UPS电源/不间断电源","516106*稳压电源","516107*净化电源","516108*逆变电源","516109*模块电源","516110*程控电源","516111*高压电源","5161*其它电源"];
arrprodu1["0_51_62"]=["516201*同步发电机","516202*异步发电机","516203*柴油发电机组","516204*汽油发电机","516205*燃气发电机","516206*水力发电机组","516207*燃煤发电机组","516208*发电机组零部件","5162*其它发电机组"];
arrprodu1["0_51_63"]=["516301*蓄电池","516302*光电池","516303*锂电池","516304*镍氢电池","516305*镍镉电池","516306*充电电池","516307*电池组配件","516308*纽扣电池","516309*干电池","5163*其它电池"];
arrprodu1["0_51_64"]=["516401*金属电极","516402*石墨电极","5164*其它电极"];
arrprodu1["0_51_70"]=["517001*电源适配器","517002*变压器","517003*稳压器","517004*节电器","517005*配电系统","517006*交直流接触器","517007*熔断器","517008*断路器","517009*脱扣器","517010*整流器","517011*滤波器","517012*电位器","517013*电机保护器","517016*高压开关柜","5170*其它通用工业电器"];
arrprodu1["0_51_71"]=["517101*低压断路器","517102*低压接触器","517103*低压熔断器","517104*过流保护器/过载保护器","517105*低压开关柜","517106*低压控制器","517107*启动器/起动器","517108*时间继电器","517109*中间继电器","517110*电磁继电器","517111*温度继电器","517112*启动继电器","517113*信号继电器","517114*固态继电器","517115*电抗器","517116*直流调速器","5171*其它低压电器"];
arrprodu1["0_51_72"]=["517201*接线端子","517202*母线槽","517203*PCB连接器","517204*工业连接器","517205*接线盒","517206*重载连接器","517207*电力/电线电缆","517208*电缆接头","517209*安全栅","517210*接触件","517211*电缆桥架","517212*控制电缆","517213*特种电缆","517214*电气设备用电缆","517215*滑触线","517216*数据线/音频线/usb线","517217*电源线","517218*光纤电缆","517219*电缆终端","517220*插座","5172*其它电气连接设备"];
arrprodu1["0_51_73"]=["517301*配电箱/柜","517302*控制柜","517303*变频柜","517304*仪表盘","517305*配电组件","517306*配电屏","5173*其它盘柜"];
arrprodu1["0_51_80"]=["518001*照相机","518002*摄影机/摄像机/摄录机","518003*图形处理器","518004*图像处理软件","518005*视觉传感器","518006*视觉系统","518007*条码系统","518008*识别系统","518009*光源","518010*机器人","518011*视频平台","518012*机械手","5180*其它机器视觉设备"];
arrprodu1["0_51_81"]=["518101*无线电系统","518102*无线遥控","518103*网管软件","518104*CDMA/码分多址","518105*RTU/远程终端单元","518106*数传电台","518107*数传模块","518108*测控终端","518109*GPRS/分组无线服务","518110*GSM/全球移动通讯系统","518111*抄表系统","5181*其它远程测控设备"];
arrprodu1["0_51_82"]=["518201*温度传感器","518202*压力传感器","518203*称重传感器","518204*光学传感器","518205*电化学传感器/电化学探头","518206*霍尔传感器","518207*测力传感器","518208*位置传感器","518209*角度传感器","518210*液位传感器","518211*湿度传感器","518212*气体传感器","518213*流量传感器","518214*光栅","518215*位移传感器","518216*速度传感器","518217*热电偶","518218*声学传感器","518219*振动传感器","518220*热电阻","5182*其它传感器/探头"];
arrprodu1["0_51_83"]=["518301*电容式变送器","518302*液位变送器","518303*物位变送器","518304*电量变送器","518305*温度变送器","518306*差压变送器","518307*气体变送器","5183*其它变送器"];

arrprodu1["0_52"]=["5210*包装设备","5220*包装成型机械","5221*包装测试设备","5230*印刷设备","5240*印前处理设备","5250*印后加工设备","5260*塑料包装容器","5270*塑料包装材料","5275*烫金/烫印材料"];
arrprodu1["0_52_10"]=["521001*充填机","521002*灌装机","521003*封口机","521004*裹包机/缠绕机","521005*多功能包装机","521006*热收缩包装机","521007*贴标机","521008*条码设备","521009*打码机/喷码机","521010*打包机","521011*集装机","521012*包装辅助设备","521013*热熔胶机","521014*包装生产线","521015*包装机械配附件","521016*套标机","521017*胶纸机","5210*其它包装设备"];
arrprodu1["0_52_20"]=["522001*食品药品包装机","522002*纸包装机械","522003*塑料包装机械","522004*金属包装机械","5220*其它包装成型机械"];
arrprodu1["0_52_21"]=["522101*压缩试验机","522102*密封试验仪","522103*热封试验仪","522104*包装检测仪","5221*其它包装测试设备"];
arrprodu1["0_52_30"]=["523001*数码印刷机","523002*热转印机","523003*丝印机","523004*移印机","523005*胶印机","523006*凹版印刷机","523007*柔印机","523008*印刷检测仪器","5230*其它印刷设备"];
arrprodu1["0_52_40"]=["524001*扫描仪","524002*制版机","524003*照排机","524004*晒版机","524005*打样机","524006*冲版机","524007*绷网机","524008*光绘机","5240*其它印前处理设备"];
arrprodu1["0_52_50"]=["525001*打孔机","525002*装订机","525003*胶装机","525004*覆膜机","525005*上光机","525006*烫金机","525007*模切机","525008*压痕机","525009*压纹机","525010*折页机","525011*复合机","525012*分切机","525013*横切机","525014*开槽机","525015*压平机","525016*配页机","525017*压光机","525018*包本机","5250*其它印后加工设备"];
arrprodu1["0_52_60"]=["526001*塑料桶","526002*塑料罐","526003*塑料薄膜袋","526004*塑料箱"];
arrprodu1["0_52_70"]=["527001*静电膜/收缩膜","527002*保护膜","527003*镀铝膜","527004*泡沫塑料","527005*拉伸缠绕膜","527006*气垫膜/气泡膜","527007*EPE珍珠棉","527008*包装薄膜","527009*铝箔袋/铝箔膜","5270*其它塑料包装材料"];
arrprodu1["0_52_75"]=["527501*烫金纸/烫金箔/电化铝","527502*烫印膜","527503*镭射纸","527504*拉丝","5275*其它烫金/烫印材料"];

arrprodu1["0_60"]=["6010*过滤材料","6020*水处理滤料","6030*填料","6040*水处理化学品","6050*耐火材料","6060*工地施工材料","6070*空气处理化学品","6080*耐酸陶瓷"];
arrprodu1["0_60_10"]=["601001*滤芯","601002*滤膜","601003*滤片","601004*滤网","601005*滤筒","601006*滤袋","601007*滤布","601008*滤板","601009*改性PP原料","601010*滤纸","601011*过滤棉","601012*滤壳","6010*其它过滤材料"];
arrprodu1["0_60_20"]=["602001*纤维球滤料","602002*陶粒滤料","602003*石英砂滤料","602004*沸石滤料","602005*磁铁矿滤料","602006*锰砂滤料","602007*果壳滤料","602008*无烟煤滤料","602009*活性炭","602010*麦饭石滤料","602011*硅藻土","6020*其它水处理滤料"];
arrprodu1["0_60_30"]=["603001*多孔球悬浮填料","603002*斜管填料","603003*组合填料","603004*软性填料","603005*丝网除沫器","603006*金属规整填料","603007*鲍尔环填料","603008*陶瓷填料","6030*其它填料"];
arrprodu1["0_60_40"]=["604001*絮凝剂","604002*聚合氯化铝","604003*聚丙烯酰胺","604004*杀菌灭藻剂","604005*阻垢剂","604006*缓蚀剂","604007*脱水剂","604008*消泡剂","604009*漂白剂","604010*杀菌剂","604011*离子交换树脂","604012*螯合剂/络合剂","604013*除垢剂","6040*其它水处理化学品"];

arrprodu1["0_60_50"]=["605001*耐火浇注料","605002*耐火砖","605003*耐火球","6050*其它耐火材料"];
arrprodu1["0_60_60"]=["606001*土工布","606002*土工膜","606003*工地网格布","606004*支撑及蝴蝶扣","606005*钢格板","6060*其它工地施工材料"];
arrprodu1["0_60_70"]=["607001*光触媒","607002*装修污染清除剂","607003*甲醛清除剂","6070*其它空气处理化学品"];
arrprodu1["0_60_80"]=["6080*其它耐酸陶瓷"];

arrprodu1["0_61"]=["6110*表面活性剂","6120*吸附剂","6130*催化剂","6140*合成材料助剂","6141*金属加工助剂","6150*造纸化学品","6160*工业润滑油","6170*油墨"];
arrprodu1["0_61_10"]=["611001*润湿/渗透剂","611002*抗静电剂","611003*洗涤剂","611004*发泡剂/消泡剂","611005*乳化剂","611006*增溶剂","611007*分散剂","6110*其它表面活性剂"];
arrprodu1["0_61_20"]=["612001*活性氧化铝","612002*活性白土","612003*硅胶","612004*纤维吸附剂","612005*矿物吸附剂","6120*其它吸附剂"];
arrprodu1["0_61_30"]=["613001*无机化工用催化剂","613002*有机化工用催化剂","613003*合成材料用催化剂","613004*石油加工催化剂","613005*催化剂用载体","6130*其它催化剂"];
arrprodu1["0_61_40"]=["614001*合成材料抗氧化剂","614002*光稳定剂","614003*热稳定剂","614004*防霉剂/抗菌剂","614005*填充剂","614006*偶联剂","614007*防老剂","614008*促进剂","614009*抗冲击剂","614010*脱模剂","614011*防雾剂","614012*橡胶油","614013*氯化石蜡","614014*合成材料阻燃剂","614015*硫化剂","614016*增塑剂","614017*软化剂","614018*发泡剂","614019*固化剂","6140*其它合成材料助剂"];
arrprodu1["0_61_41"]=["614101*防锈润滑剂","614102*金属清洗剂","614103*热处理介质","614104*助焊剂","614105*成型油/成形油","614106*拉拔液","614107*压铸液","614108*切削液/切削油","614109*轧制液/轧制油","614110*电镀助剂","614111*热处理油","614112*金属工艺液","6141*其它金属加工助剂"];
arrprodu1["0_61_50"]=["615001*制浆助剂","615002*抄纸助剂","615003*涂布剂","615004*涂布助剂","6150*其它造纸化学品"];
arrprodu1["0_61_60"]=["616001*冷冻机油","616002*压缩机油","616003*液压油/传动油","616004*机械油","616005*工业齿轮油","616006*工业润滑脂","616007*导轨油","616008*导热油","616009*真空泵油及扩散泵油","616010*电器绝缘油","6160*其它工业润滑油"];
arrprodu1["0_61_70"]=["617001*塑料油墨","617002*印纸油墨","617003*UV油墨","617004*印布油墨","617005*玻璃油墨","617006*防伪油墨","617007*印铁油墨","617008*橡胶油墨","617009*陶瓷油墨"];

arrprodu1["0_70"]=["7010*防腐设备","7011*真空设备","7012*密封件","7013*弹簧","7017*管件","7020*过滤设备","7021*分离设备","7022*空分设备","7023*空压机","7024*混合设备","7025*干燥设备","7026*反应设备/反应釜","7027*结晶设备","7030*消音降噪设备","7040*风机","7050*泵","7060*阀","7061*水工机械","7070*涂装/喷涂设备","7071*涂料","7075*工业气体","7080*安全防护设备用品","7090*消防设备","7091*防雷设备","7094*加注机","7095*商用专业设备"];
arrprodu1["0_70_10"]=["701001*水箱","701003*储罐","701004*运输罐","701006*管道","701007*管材","701008*地坪","701015*计量罐/计量槽","701016*搅拌罐/搅拌器","701018*吸收塔/中和塔/填料塔","701019*塔节","701020*玻璃钢防腐设备","701021*钢衬塑防腐设备","701022*氟塑防腐设备","701023*聚丙烯防腐设备","701024*酸洗设备","701026*防腐剂","701027*热熔器/熔接器","701028*补偿器","701029*法兰","7010*其它防腐设备"];
arrprodu1["0_70_11"]=["701101*真空机组","701102*真空包装机","701103*真空炉","701104*真空发生器","701105*真空罐","701106*真空元件","7011*其他真空设备"];
arrprodu1["0_70_12"]=["701201*油封","701202*密封垫片","701203*密封垫圈","701204*密封条","701205*密封垫","701207*机械密封件","701208*盘根","7012*其他密封件"];
arrprodu1["0_70_13"]=["701301*支撑杆","701302*支吊架","7013*其它弹簧"];
arrprodu1["0_70_17"]=["701701*管帽","701703*弯头","701704*三通/管件三通","701705*四通/四通管件/管件四通","701707*不锈钢管件","701708*碳钢管件","701709*铜管件","701710*PPR管件","701711*异径管/大小头","7017*其他管件"];
arrprodu1["0_70_20"]=["702001*机械过滤器","702002*活性炭过滤器","702003*水过滤器","702004*滤油机","702005*滤清器","702006*过滤机","702007*自清洗过滤器","702008*高效过滤器","702009*精密过滤器","702010*硅藻土过滤器","702011*Y型过滤器","702012*砂棒过滤器","702013*活性砂过滤器","7020*其它过滤设备"];
arrprodu1["0_70_21"]=["702101*蒸馏设备","702102*萃取设备","702103*膜分离设备","702104*汽水分离器/气水分离器","702105*溶剂回收机","7021*其它分离设备"];
arrprodu1["0_70_22"]=["702201*分子筛","702202*制氧机","702203*制氮机","702204*氮气发生器","702205*氨气分解炉","702206*精馏塔","702207*纯化设备","702208*压力容器","702209*膨胀机","702210*氢氮压缩机","702211*氧气压缩机","702212*空分设备配件","7022*其他空分设备"];
arrprodu1["0_70_23"]=["702301*螺杆式空压机","702302*活塞式空压机","702303*离心式空压机","702304*滑片式空压机","702305*涡旋空压机","702306*空压机配件","7023*其他空压机"];
arrprodu1["0_70_24"]=["702401*混合机","702402*捏合机","702403*分散机","702404*乳化机","702405*均质设备","7024*其他混合设备"];
arrprodu1["0_70_25"]=["702501*热风炉","702502*喷雾干燥机","702503*真空干燥机","702504*流化床干燥机/沸腾干燥机","702505*闪蒸干燥机","702506*微波干燥机","702507*空气干燥机","702508*带式干燥机","702509*箱式干燥机","702510*滚筒干燥机","702511*回转式干燥机","702512*振动干燥机","702513*组合式干燥机","702514*连续干燥机","702515*双锥干燥机","702516*浆叶式干燥机","702517*制粒机/制粒干燥设备","702518*防潮箱/防潮柜","702519*UV干燥设备","7025*其它干燥设备"];
arrprodu1["0_70_26"]=["702601*不锈钢反应釜","702602*玻璃反应釜","702603*搪瓷反应釜","702604*高压反应釜","702605*管式反应器","702606*塔式反应器","702607*槽式反应器","702608*电解槽","702609*发酵提取设备","7026*其它反应设备/反应釜"];
arrprodu1["0_70_27"]=["702701*结晶釜/结晶罐","702702*蒸发结晶器","702703*冷却结晶器","7027*其它结晶设备"];
arrprodu1["0_70_30"]=["703001*隔音、吸声材料","703002*噪声控制","703003*消声器","703004*减震器","703005*抗震型","703006*避震器","703007*隔振器","703008*消声室/静音房","703009*缓冲器","7030*其它消音降噪设备"];
arrprodu1["0_70_40"]=["704001*罗茨风机","704003*通风机","704004*风幕机","704005*离子风机","704006*塑料风机","704007*防腐风机","704008*回旋风机","704009*离心风机","704010*射流风机","704011*斜流风机/混流风机","704012*旋涡风机","704013*诱导风机","704014*管道风机","704015*涡轮/屋顶风机","704016*船用风机","704017*地铁/隧道风机","704018*电站风机","704019*防火排烟风机","704020*矿用风机","704021*冷却塔用风机","704022*煤粉/排尘风机","704023*消防风机","704024*高炉/锅炉鼓风机","704026*散热风机/直流风扇","704028*冷却风扇","704029*喷雾风机","704031*手提/手摇风机","704032*温室大棚风机/负压风机","704033*低噪音/低噪声风机","704034*高温风机","704035*中压/高压风机","704036*排气扇/换气扇","704050*风管","704051*风叶","704053*气楼/通风天窗","7040*其它风机"];
arrprodu1["0_70_50"]=["705001*清水泵","705002*污水泵","705003*排污泵","705004*潜水泵","705005*管道泵","705006*隔膜泵","705007*计量泵","705008*磁力泵","705009*离心泵","705010*真空泵","705011*液下泵","705012*转子泵","705013*螺杆泵","705014*齿轮泵/齿轮油泵","705015*滑片泵","705016*凸轮泵","705017*旋涡泵","705018*柱塞泵/双球柱塞泵","705019*水环真空泵/水环泵","705020*液环泵/水环泵","705021*化工泵","705022*消防泵","705023*空调泵","705024*试压泵","705025*深井泵","705026*泥浆泵/砂浆泵","705027*油泵/润滑泵","705028*混流泵","705029*轴流泵","705030*喷射泵","705031*往复泵","705032*罗茨泵","705033*自吸泵","705034*屏蔽泵/屏蔽电泵","705035*增压泵","705036*高压泵","705037*渣浆泵","705038*滑阀真空泵","705039*旋片泵","705040*分子泵","705041*干泵","705042*蠕动泵","705043*泵站","705044*塑料泵","7050*其它泵"];
arrprodu1["0_70_60"]=["706001*调节阀","706002*截止阀","706003*隔膜阀","706004*流体阀","706005*疏水阀","706006*电磁阀/脉冲阀","706007*止回阀","706008*蝶阀","706009*球阀","706010*闸阀","706011*管夹阀","706012*滑阀","706013*角阀","706014*针型阀/仪表阀","706015*柱塞阀","706016*旋塞阀","706017*安全阀","706018*放料阀","706019*分流阀/集流阀","706020*换向阀","706021*减压阀","706022*节流阀","706023*控制阀","706024*排气阀","706025*排污阀/排泥阀","706026*平衡阀","706027*单向阀","706028*燃气阀","706029*底阀","706030*脚踏阀","706031*排空阀","706032*挡板阀","706033*释放阀","706034*微调阀","706035*充气阀","706036*水锤消除器/水锤吸纳器","706037*电动阀","706038*管力阀","706039*阀门配件","706040*阀门执行机构","706041*塑料阀","7060*其它阀"];
arrprodu1["0_70_61"]=["706101*启闭机","706102*闸门","706103*遇水膨胀止水条","706104*拍门","7061*其它水工机械"];
arrprodu1["0_70_70"]=["707001*涂装前处理设备","707002*抛丸机/抛丸清理机","707003*喷砂机","707004*喷漆/涂装流水线","707005*喷漆机/喷涂机","707006*喷粉机/粉末喷涂设备","707007*喷枪","707008*烤漆设备","707009*上胶机","707010*涂布机","707011*喷漆室/喷漆房","707012*喷漆台","707013*电泳设备","707014*涂装烘干设备","707015*静电发生器","707016*喷漆吊具/涂装悬挂","707017*带式输送机/皮带输送机","707018*电镀设备","707019*真空电镀设备","707020*水电镀设备","707021*热风枪","707022*焊枪","707023*压力桶","707024*不锈钢粉桶","707025*抛光机","707026*电镀电源/电解电源","707027*水帘柜","707028*涂装配件","7070*其它涂装/喷涂设备"];
arrprodu1["0_70_71"]=["707101*防火涂料","707102*粉末涂料","707103*保温涂料","707104*防腐涂料","707105*耐高温涂料","707106*特种涂料","707107*木器涂料","707108*艺术涂料","707109*内墙涂料","707110*金属漆","707111*防水涂料","7071*其他涂料"];
arrprodu1["0_70_75"]=["7075*其它工业气体"];
arrprodu1["0_70_80"]=["708001*防护服","708002*呼吸器","708003*防护口罩","708004*防护眼镜/劳保眼镜","708005*洗眼器","708006*防护耳塞","708007*防护面罩","708008*防护手套","708009*防护鞋","708010*防护帽","708011*安全带","708012*安全网","708013*软梯","708014*救生器材","708015*安全光幕","708016*担架","7080*其它安全防护设备用品"];
arrprodu1["0_70_90"]=["709001*灭火器材","709002*火警探测","709003*防火设备","709004*防爆器材","709005*消防警示标志","709006*消防水炮","709007*消防栓","7090*其它消防设备"];
arrprodu1["0_70_91"]=["709101*避雷器","709102*防雷/浪涌保护器","709103*防雷箱","709104*防雷元件测试仪","7091*其它防雷设备"];
arrprodu1["0_70_94"]=["7094*其它加注机"];
arrprodu1["0_70_95"]=["709501*自动售货机","7095*其它商用专业设备"];

arrprodu1["0_71"]=["7101*洗矿选矿设备","7102*振动筛分设备","7119*粉碎设备","7120*破碎设备","7121*磨矿设备","7122*矿用钻机及配件","7125*支护设备","7130*挖沙机械","7140*给料设备","7150*装卸输送设备","7160*炼钢设备","7161*轧钢设备","7162*炼铁设备","7170*焊接设备","7171*切断设备","7180*工业炉"];
arrprodu1["0_71_01"]=["710101*煤炭选洗设备","710102*尾矿回收设备","710103*造粒设备","710104*风选设备","710105*砖机设备","710106*洗砂设备","710107*摇床设备","710108*螺旋溜槽","710109*浓缩设备","710110*跳汰机","710111*浮选设备","710112*分级设备","710113*永磁磁选机","710114*筒式磁选机","710115*辊式磁选机","710116*除铁机","710117*水利旋流器","7101*其它洗矿选矿设备"];
arrprodu1["0_71_02"]=["710201*旋振筛","710202*气流筛","710203*直线筛","710204*过滤筛","710205*实验筛","710206*分级筛","710207*脱水筛","710208*筛网","7102*其它振动筛分设备"];
arrprodu1["0_71_19"]=["711901*超声波粉碎机","711902*高速万能粉碎机","711903*颗粒粉碎机","711904*气流粉碎机","711905*涡轮粉碎机","711906*制样粉碎机","7119*其它粉碎设备"];
arrprodu1["0_71_20"]=["712001*辊式破碎机","712002*锤式破碎机","712003*冲击破碎机","712004*笼式破碎机","712005*鄂式破碎机","712006*圆锥破碎机","712007*反击破碎机","712008*制砂机","712009*风镐","7120*其它破碎设备"];
arrprodu1["0_71_21"]=["712101*球磨机","712102*研磨机","712103*砂磨机","712104*棒磨机","712105*雷磨机","712106*煤磨机","712107*角磨机","712108*直磨机","712109*磨粉机","712110*管磨机","712111*高压磨","712112*辊磨机","712113*振动磨机","712114*自磨机","712115*砾磨机","7121*其他磨矿设备"];
arrprodu1["0_71_22"]=["712201*潜孔钻机","712202*凿岩钻机","712203*锚杆钻机","712204*锚杆","712205*风煤钻","712206*工程钻机","712207*冲击钻孔","712208*钻杆","712209*钻头","712210*钻机配件","712211*扩孔钻机","712212*煤电钻","7122*其他矿用钻机及配件"];
arrprodu1["0_71_25"]=["7125*其他支护设备"];
arrprodu1["0_71_30"]=["713001*挖沙船/采沙船/采砂船","713002*抽沙船/吸沙船","713003*挖泥船","713004*铁砂船/铁沙船","713005*清淤船","713006*淘金船/采金船","713007*旱选机","713008*筛沙机","713009*洗石机","713010*采矿船/选矿船","7130*其他挖沙机械"];
arrprodu1["0_71_40"]=["714001*螺旋给料机","714002*皮带给料机","714003*往复给料机","714004*摆式给料机","714005*圆盘给料机","714006*槽式给料机","714007*板式给料机","714008*定量给料机","714009*叶轮给料机","714010*筛分给料机","7140*其他给料设备"];
arrprodu1["0_71_50"]=["715001*矿车","715002*升降机/升降平台","715003*提升机","715004*装载机","715005*输送机","715006*卷扬机/绞车","715007*堆高车/堆高机","715008*自卸车/翻斗车","715009*铲运机","715010*挖掘机","715011*起重机/吊车","715012*搬运车/装卸车","715013*喷浆机","715014*平板车","715015*压路机","715016*转载机","715017*翻车机","715018*叉车","715019*推土机","715020*扒渣机","715021*输送带/传送带/运输带","715022*倒袋站/开袋站","715023*登车桥","7150*其它装卸设备/输送设备"];
arrprodu1["0_71_60"]=["716001*挡渣板","716002*连铸机","716003*结晶器","716004*铁水脱硫设备","716005*塞棒","716006*辊缝仪","716007*锥度仪","7160*其它炼钢设备"];
arrprodu1["0_71_61"]=["716101*滚弯机/打弯机","716102*冷轧机","716103*轧管机","716104*修磨机","716105*热镀锌/热浸锌","716106*电镀锡","716107*卷板机","716108*折弯机","716109*矫直机","716110*冷弯机","716111*焊管机/焊管机组/焊管设备","716112*圆弧机","716113*弯管机","716114*压瓦机","716115*导卫","716116*冷床","716117*压力机","716118*剪板机","716119*滚槽机","7161*其它轧钢设备"];
arrprodu1["0_71_62"]=["716201*铸铁机","716202*堵渣机","716203*冷却壁/板","716204*开铁口机","716205*高炉风口","716206*送风支管","716207*水包","716208*泥炮","716209*铁水罐车","7162*其它炼铁设备"];
arrprodu1["0_71_70"]=["717001*焊接机","717002*对焊机","717003*弧焊机","717004*焊割机","717005*点焊机","717006*凸焊机","717007*滚焊机","717008*排焊机","7170*其它焊接设备"];
arrprodu1["0_71_71"]=["717101*切割机","717102*圆锯机","717103*卷边机","717104*分条机","717105*磨样机","717106*铣床","717107*液压机","717108*剪切机","717109*飞剪","717111*刀头","7171*其他切断设备"];
arrprodu1["0_71_80"]=["718001*热处理炉","718002*高炉设备","718003*淬火炉","718004*电阻炉","718005*退火炉","718006*烧结炉","718007*燃烧炉","718008*冲天炉","718009*烘烤器","718010*拆炉机","718011*烧嘴/燃烧器","718012*热洁炉","718013*感应炉","7180*其他工业炉"];

arrprodu1["0_72"]=["7210*压实机械","7211*路面机械","7215*桥梁机械","7220*养护机械","7230*桩工机械","7231*混凝土机械","7240*起重机械","7250*隧道机械","7255*港口机械","7260*建筑机械"];
arrprodu1["0_72_10"]=["721001*轮胎压路机","721002*单钢轮压路机","721003*双钢轮压路机","721004*三轮压路机/光轮压路机/静碾压路机","721005*羊角压路机","721006*冲击压路机","721007*平板夯","721008*冲击夯","7210*其它压实机械"];
arrprodu1["0_72_11"]=["721101*平地机","721102*沥青搅拌设备/沥青搅拌机","721103*稳定土拌合站/稳定土拌合机","721104*碎石撒布机","721105*摊铺机","7211*其它路面机械"];
arrprodu1["0_72_15"]=["721501*架桥机/提梁机","721502*运梁车","721503*桥梁检测车","7215*其它桥梁机械"];
arrprodu1["0_72_20"]=["722001*沥青洒布车","722002*道路标线设备","722003*铣刨机","722004*沥青路面修补车","722005*稀浆封层机","722006*灌缝机","7220*其它养护机械"];
arrprodu1["0_72_30"]=["723001*旋挖钻机","723002*旋喷钻机","723003*水平定向钻","723004*连续墙抓斗","723005*打桩锤","723006*打桩机/压桩机","723007*顶管机","7230*其它桩工机械"];
arrprodu1["0_72_31"]=["723101*混凝土泵车","723102*混凝土泵/拖泵","723103*粉粒物料运输车/散装水泥车","723104*布料机/布料杆","723106*混凝土搅拌站","723107*混凝土搅拌机","723108*混凝土搅拌车/田螺车","7231*其它混凝土机械"];
arrprodu1["0_72_40"]=["724001*桥式起重机","724002*门式起重机/龙门吊","724003*塔式起重机/塔吊","724004*吊车","7240*其它起重机械"];
arrprodu1["0_72_50"]=["725001*盾构机","725002*掘进机/掘进车","725003*喷锚机","7250*其它隧道机械"];
arrprodu1["0_72_55"]=["725501*正面吊","725502*吊具","7255*其它港口机械"];
arrprodu1["0_72_60"]=["726001*钢筋弯曲机","726002*钢筋切断机","726003*钢筋和预应力机械","726004*钢筋调直机","726005*锚具","7260*其它建筑机械"];

arrprodu1["0_73"]=["7310*建筑钢材","7320*热轧板/热轧卷","7321*冷轧板/冷轧卷","7330*中厚板","7331*容器板","7332*低合金钢","7333*硅钢","7340*涂镀钢材","7350*带钢","7360*金属管材","7365*金属型材","7366*金属网","7370*不锈钢材","7371*特优钢","7380*磁性材料","7381*炉料","7382*非金属矿产","7383*有色金属合金"];
arrprodu1["0_73_10"]=["731001*螺纹钢","731002*线材/盘条","731003*普通圆钢","7310*其它建筑钢材"];
arrprodu1["0_73_20"]=["732001*普热轧板/普热轧卷","732002*花纹板/花纹卷","732003*酸洗板/酸洗卷","732004*冷轧料","732005*锅炉板","732006*深冲料","732007*船卷","7320*其它热轧板/热轧卷"];
arrprodu1["0_73_21"]=["732101*冷轧板/冷轧卷","732102*冷轧深冲料","732103*轧硬卷","732104*冷轧高强度钢","732105*搪瓷钢","732106*冷轧结构钢","732107*冷轧低合金钢","7321*其它冷轧板/冷轧卷"];
arrprodu1["0_73_30"]=["733001*普中板","733002*船板","733003*耐磨板","733004*汽车大梁板/汽车大梁钢","733005*机械结构用钢","733006*管线钢","733007*桥梁板","7330*其它中厚板"];
arrprodu1["0_73_31"]=["733101*锅炉容器板","733102*压力容器板","7331*其它容器板"];
arrprodu1["0_73_32"]=["733201*低合金卷","733202*低合金板","7332*其它低合金钢"];
arrprodu1["0_73_33"]=["733301*取向硅钢片","733302*无取向硅钢片","7333*其它硅钢"];
arrprodu1["0_73_40"]=["734001*镀锌板/镀锌卷","734002*彩涂板/彩涂卷","734003*镀锡板/镀锡卷/马口铁","734004*镀铝锌","734005*镀铬板/镀铬卷","7340*其它涂镀钢材"];
arrprodu1["0_73_50"]=["735001*热轧带钢","735002*冷轧带钢","735003*镀锌带钢","7350*其它带钢"];
arrprodu1["0_73_60"]=["736001*无缝管","736002*焊管","736003*镀锌管","736004*方矩管","736005*螺旋管","736006*合金管","736007*流体管","736008*结构管","7360*其它金属管材"];
arrprodu1["0_73_65"]=["736501*等边角钢","736502*槽钢","736503*扁钢","736504*冷弯型钢","736505*H型钢","736506*工字钢","736507*异型钢","736508*方钢","736509*钢轨","736510*不等边角钢","7365*其它金属型材"];
arrprodu1["0_73_66"]=["736601*铁丝网","736602*钢丝网","736603*铜丝网","736604*铝丝网","736605*不锈钢网","736606*金属板网","736607*金属网带","7366*其它金属网"];
arrprodu1["0_73_70"]=["737001*不锈钢管","737002*不锈钢板/不锈钢卷","737003*不锈钢棒材","737004*不锈钢线材","737005*不锈钢带","737006*不锈钢圆钢","737007*不锈钢扁钢","737008*不锈钢角钢","737009*不锈钢槽钢","737010*不锈钢坯","737011*不锈钢方钢","7370*其它不锈钢材"];
arrprodu1["0_73_71"]=["737101*冷作模具钢","737102*热作模具钢","737103*塑料模具钢","737104*塑胶模具钢","737105*弹簧钢","737106*碳结钢","737107*合金钢","737108*合结钢","737109*冷拉钢","737110*切削钢","737111*工具钢","737112*轴承钢","737113*耐热钢","737114*冷拔钢","737115*齿轮钢","737116*冷镦钢","737117*耐候钢","737118*耐腐蚀钢","7371*其它优特钢"];
arrprodu1["0_73_80"]=["738001*永磁材料","738002*软磁材料","7380*其它磁性材料"];
arrprodu1["0_73_81"]=["738101*生铁","738102*钢坯","7381*其它炉料"];
arrprodu1["0_73_82"]=["738201*珍珠岩","738202*方解石","738203*电石/碳化钙","738204*电气石/碧玺","738205*水镁石/氢氧镁石","738206*长石","738207*重晶石","738208*石英","738209*萤石","738210*硅灰石","738211*石墨","738212*硫矿","738213*石棉","738214*蛭石","738215*石灰石","738216*云母","738217*滑石粉","738218*透明粉","738219*高岭土","738220*膨润土","738221*砾石/卵石","7382*其它非金属矿产"];
arrprodu1["0_73_83"]=["738301*镍合金","738302*锡合金","738303*铅合金","738304*钛合金","738305*稀土合金","738306*铜合金","738307*锌合金","738308*镁合金","738309*硬质合金","7383*其它有色金属合金"];

arrprodu1["0_74"]=["7410*集装整理设备","7420*物流辅助器材","7430*仓储设备","7440*运输搬运设备"];
arrprodu1["0_74_10"]=["741001*周转箱/物流箱","741002*集装桶/吨罐","741003*集装箱","741004*集装袋/吨装袋/太空袋","741005*工具柜","741006*整理架","7410*其它集装整理设备"];
arrprodu1["0_74_20"]=["742001*塑胶托盘/塑料托盘","742002*金属托盘","742003*木托盘","742004*纸托盘","742005*护角","742006*充气袋","7420*其它物流辅助器材"];
arrprodu1["0_74_30"]=["743001*仓储笼","743002*仓储货架","7430*其它仓储设备"];
arrprodu1["0_74_40"]=["744001*物流台车","744002*物流手推车","744003*工具车","744004*医用推车","7440*其它运输搬运设备"];


arrprodu1["0_75"]=["7510*塑料机械","7520*塑机辅机","7530*塑料包装机械","7550*橡胶机械"];
arrprodu1["0_75_10"]=["751001*注塑机","751002*塑料挤出机","751003*塑料造粒机","751004*吹膜机","751005*吸塑机","751006*压塑机","751007*吹瓶机","751008*发泡设备","751009*塑料拉丝机","751010*塑料压延机","751011*塑料编织机","751012*塑料成型机","751013*塑料管材设备","751014*塑料板材设备","751015*加料再生破碎机/废塑料破碎清洗回收处理机","751016*塑机配件","7510*其它塑料成型机械"];
arrprodu1["0_75_20"]=["752001*吸料机","752002*拌料机","752003*混料机","752004*填料机","752005*混色机","752006*模温机","752007*水温机","752008*油温机","752009*收卷机","752010*切粒机","752011*脱水机","752012*扩口机","752013*慢速机","752014*密炼机","752015*螺杆","7520*其它塑机辅机"];
arrprodu1["0_75_30"]=["753001*制袋机","753002*封口机","753003*收缩膜包装机","753004*塑料印刷机械","7530*其它塑料包装机械"];
arrprodu1["0_75_50"]=["755001*硫化机","755002*炼胶机","755003*橡胶挤出机","755004*橡胶成型机","755005*切胶机","755006*橡胶压延机","755007*橡胶造粒机","755008*橡胶裁断机","755009*橡塑设备","755010*硫化罐","755011*橡胶贴合机","755012*橡胶定型机","755013*橡胶接头机","7550*其它橡胶机械"];

arrprodu1["0_80"]=["8010*环保节能","8011*灯","8012*专门用途灯具","8013*气体放电灯","8020*太阳能设备","8030*风能","8040*节能建材","8050*燃气设备"];
arrprodu1["0_80_10"]=["801001*地热发电","801005*生物质能","801006*沼气发电","801007*沼气池/沼气罐","801008*焚烧发电/垃圾发电","801009*雨水收集系统","801010*节水灌溉","801011*节煤剂","801012*节油器/省油器","801013*节能灯","801015*无极灯","801016*无功补偿","801019*沼气采暖炉","801022*汽化器/气化器","801023*气化炉","801024*节水器/节水控制器","801025*燃烧机","8010*其它环保节能"];
arrprodu1["0_80_11"]=["801101*景观灯","801102*雕塑灯","801103*庭院灯","801104*地埋灯","801105*草坪灯","801106*泛光灯","801107*变色灯","801108*霓虹灯","801109*电脑灯","801110*礼花灯","801111*水底灯/水下灯","801112*道路灯","801113*高杆灯","801114*探照灯","801115*投影灯","801116*地砖灯","801117*光纤灯","801118*激光灯","801119*日光灯/荧光灯","801120*应急灯/应急照明","801121*照明灯","801122*白炽灯","801123*镇流器","801124*灯头","801125*灯杯","801126*灯柱/灯杆","801127*洗墙灯/投光灯","8011*其他灯"];
arrprodu1["0_80_12"]=["801201*led灯/发光二极管","801202*防爆灯","801203*广告灯具","801204*射灯","801205*舞台灯","801206*紫外线灯/紫外线杀菌灯/uv灯","801207*装饰灯","801208*红外线灯","801209*机床灯","801210*医疗灯","801211*工矿灯","801212*灭蚊灯","801213*摄影灯","801214*信号灯","801215*交通警示灯","801216*航空障碍灯","801217*防爆电筒","801218*照明车","8012*其他专门用途灯具/专用灯具"];
arrprodu1["0_80_13"]=["801301*氙气灯","801302*荧光灯管","801303*汞灯","801304*金卤灯","801305*氖灯","801306*紫外线灯管","8013*其他气体放电灯"];
arrprodu1["0_80_20"]=["802001*太阳能发电/光伏发电","802002*太阳能电池/板","802003*太阳能灯","802005*太阳能集热板/器","802006*阳光导入器","802007*光导照明系统","802008*太阳能空调","802009*太阳能采暖/太阳能供暖","802010*太阳能灶","802011*太阳能蓄电池","802012*太阳能充电器","802013*太阳能水箱","802014*太阳能真空管","802015*太阳能支架","802017*太阳能控制器","802018*太阳能逆变器/光伏并网逆变器","802019*太阳能接线盒","802020*光伏电缆/太阳能电缆","802021*封装膜","802022*封装膜","8020*其它太阳能设备"];
arrprodu1["0_80_30"]=["803001*风力发电","803002*风力发电机","803003*风光互补路灯","803004*风力提水机","803006*风车叶片","803007*风力发电电缆","8030*其它风能设备"];
arrprodu1["0_80_40"]=["804001*活动房/活动板房/岗亭","804002*保温棉","804003*岩棉制品","804004*保温板","804005*保温套","804006*保温管","8040*其它节能建材"];
arrprodu1["0_80_50"]=["805001*燃气调压箱/燃气调压柜","805002*燃气调压器/燃气调压阀","805003*燃气切断阀","8050*其它燃气设备"];

arrprodu1["0_85"]=["8510*五金配件","8530*紧固件/连接件","8540*磨具","8550*绝缘材料"];
arrprodu1["0_85_10"]=["851001*接头","851002*直通","851003*卡箍/抱箍","851004*管夹","851005*索具","851006*滑轮","851007*脚轮","851008*吊钩","851009*钢珠","851010*井盖","851011*卸扣","851012*轴瓦轴衬","851013*斗齿","851014*托辊","851015*滚筒","851016*炉头","851017*铝箔管","851018*铝箔软管","851019*增强软管","8510*其它五金配件"];
arrprodu1["0_85_30"]=["853001*螺栓","853002*螺钉","853003*螺柱","853004*螺母","853005*螺塞","853006*销/键","853007*铆钉","853008*卡簧/挡圈","853009*异型件","853010*组合件/连接副","8530*其它紧固件/连接件"];
arrprodu1["0_85_40"]=["854001*砂轮","854002*磨片/切割片","854003*砂纸/砂布","854004*砂带","854005*磨头","854006*抛光轮","854007*磨石/油石","854008*页轮/页片","854009*钢丝轮","854010*磨块","8540*其它磨具"];
arrprodu1["0_85_50"]=["855001*绝缘套管","855002*绝缘带","855003*绝缘垫片","855004*绝缘板","855005*绝缘隔离柱","855006*绝缘子","855007*绝缘胶板","855008*绝缘纸","8550*其它绝缘材料"];

arrprodu1["0_86"]=["8610*锅炉","8611*锅炉辅机","8620*供热/采暖/取暖设备","8630*空调设备","8640*换热/传热设备","8650*电热设备","8660*热水器","8666*水暖五金","8670*制冷设备","8671*冷却塔","8680*保鲜冷藏设备"];
arrprodu1["0_86_10"]=["861001*工业锅炉","861002*生活锅炉","861003*电站锅炉","861004*车船用锅炉","8610*其它锅炉"];
arrprodu1["0_86_11"]=["861101*锅炉调速箱","861102*给煤机","861103*省煤器","861104*引风机","861105*返料风机","861106*炉排","861107*出渣机","861108*分汽缸/分汽包","861109*排污膨胀器/稳压膨胀器","861110*人孔","861111*减温减压装置","861112*点火器/点火装置","8611*其它锅炉辅机"];
arrprodu1["0_86_20"]=["862001*地热供暖系统","862002*地暖管材","862003*地暖/地板采暖","862004*地热空调","862005*地热泵/地源热泵","862006*水源热泵","862007*泳池热泵","862008*热泵控制器/热泵控制板","862009*保温水箱","862010*承压水箱","862011*壁炉","862012*电暖气/电暖器","862013*暖风机","862014*分集水器","862015*暖气片/散热器","8620*其它供热/采暖设备"];
arrprodu1["0_86_30"]=["863001*中央空调","863002*柜机","863003*壁挂机","863004*窗式机","863005*汽车空调","863006*空调配件","8630*其它空调设备"];
arrprodu1["0_86_40"]=["864001*换热器","864002*冷却器","864003*冷凝器","864004*蒸发器","864005*加热器","864007*阻火器","864008*自动排水器","8640*其它换热设备/传热设备"];
arrprodu1["0_86_50"]=["865001*电热带","865002*电热器","865003*电热膜","865004*电热丝","865005*电热线","865006*电热片","865007*电热板","865008*工业电炉","865009*实验电炉","865010*工业烤箱","865011*熔锡炉","865012*硅碳棒","865013*电热管/发热管","865014*电热盘/发热盘","8650*其它电热设备"];
arrprodu1["0_86_60"]=["866001*电热水器","866002*中央热水器","866003*燃气热水器","866004*空气源热泵","866005*太阳能热水器","866006*热水器配件","8660*其它热水器"];
arrprodu1["0_86_66"]=["866601*水龙头","866602*阀芯/快开","866603*水嘴","866604*阀片","866605*混水阀","866606*三角阀","866607*花洒及配件","866608*花洒软管","866609*冲洗阀","866610*地漏","8666*其它制冷设备"];
arrprodu1["0_86_70"]=["867001*制冷机","867002*制冷压缩机","867003*冷冻机","867004*风冷式冷冻机","867005*水冷式冷冻机","867006*冷水机","867007*螺杆式冷水机","867008*开放式冷水机","867009*淋水装置","867010*制冷设备配件","867011*冷媒回收机","8670*其它制冷设备"];
arrprodu1["0_86_71"]=["867101*逆流式冷却塔","867102*横流式冷却塔","867103*喷雾式冷却塔","867104*封闭式冷却塔","8671*其它冷却塔"];
arrprodu1["0_86_80"]=["868001*冷藏车/保温车","868002*保鲜柜","868003*陈列柜","868004*冷柜/冷藏柜/冰柜","868005*冷藏箱","868006*冷风机/湿帘冷风机","868007*冷库","868008*制冰机","868009*低温冰箱","8680*其它保鲜冷藏设备"];

arrprodu1["0_87"]=["8710*塑料管","8711*塑料板/塑料卷","8712*塑料片","8713*塑料薄膜","8714*塑料篷布","8719*塑料浮体","8720*橡胶管","8721*橡胶板","8722*橡胶带","8730*橡胶片","8731*橡胶棒","8732*塑料棒/塑料条","8733*塑料焊条","8734*胶垫","8735*塑胶容器","8736*塑料合金"];
arrprodu1["0_87_10"]=["871001*PPR管/聚丙烯管","871002*PE管","871003*ABS管/苯已烯管","871004*PP管","871005*PVC管","871006*铝塑管","871007*波纹管","871008*PMMA管","871009*PC管","871010*PA管","871011*PU管","8710*其它塑料管"];
arrprodu1["0_87_11"]=["871101*PVC塑料板/PVC塑料卷","871102*PE塑料板/PE塑料卷","871103*ABS塑料板/ABS塑料卷","871104*POM塑料板/POM塑料卷","871105*PMMA塑料板/PMM塑料卷","871106*PS塑料板/PS塑料卷","871107*PEEK塑料板/PEEK塑料卷","871108*PTFE塑料板/PTFE塑料卷","871109*PVDF塑料板/PVDF塑料卷","871110*PC塑料板/PC塑料卷","871111*PP塑料板/PP塑料卷","8711*其它塑料板/塑料卷"];
arrprodu1["0_87_12"]=["871201*PP塑料片","871202*PE塑料片","871203*PET塑料片","871204*ABS塑料片","871205*PMMA塑料片","871206*PC塑料片","871207*PS塑料片","871208*PVC塑料片","8712*其它塑料片"];
arrprodu1["0_87_13"]=["871301*农用薄膜","871302*功能薄膜","871303*降解薄膜","871304*聚酯薄膜","871305*离型膜","871306*建筑膜","8713*其它塑料薄膜"];
arrprodu1["0_87_14"]=["871401*农用篷布","871402*工业用篷布","871403*货场盖布","871404*船用篷布","8714*其它塑料篷布"];
arrprodu1["0_87_19"]=["8719*其它塑料浮体"];
arrprodu1["0_87_20"]=["872001*伸缩胶管","872002*胶管接头","872003*特种胶管","872004*耐油胶管","872005*缠绕胶管","872006*夹布胶管","872007*编织胶管","872008*高压橡胶管","872009*硅胶管","872010*复合胶管","872011*液压胶管","872012*喷砂胶管","872013*乳胶管","8720*其它橡胶管"];
arrprodu1["0_87_21"]=["872101*夹布胶板","872102*绝缘胶板","872103*耐油胶板","872104*耐酸碱胶板","872105*防腐衬里","872106*阻尼胶板","872107*防腐胶板","872108*防滑胶板","872109*耐磨胶板","872110*防静电胶板","872111*特种胶板","8721*其它橡胶板"];
arrprodu1["0_87_22"]=["872201*橡胶止水带","872203*橡胶履带","872204*橡胶捆绑带","8722*其它橡胶带"];
arrprodu1["0_87_30"]=["8730*其它橡胶片"];
arrprodu1["0_87_31"]=["8731*其它橡胶棒"];
arrprodu1["0_87_32"]=["8732*其它塑料棒/塑料条"];
arrprodu1["0_87_33"]=["8733*其它塑料焊条"];
arrprodu1["0_87_34"]=["8734*其它胶垫"];
arrprodu1["0_87_35"]=["873501*滚塑化工容器/塑胶化工容器","873502*塑胶储物箱","8735*其它塑胶容器"];
arrprodu1["0_87_36"]=["873601*PC/ABS","873602*PC/PBT","8736*其它塑料合金"];

arrprodu1["0_88"]=["8810*电动工具","8811*气动工具","8812*手动工具","8816*气焊器材/电焊器材","8860*匠作工具","8865*钳工工具","8868*管工工具","8870*电工工具","8880*磨料"];
arrprodu1["0_88_10"]=["881001*电镐","881002*电刨","881003*电钻","881004*电锯","881005*电锤","881006*电动螺丝刀/电动起子","881007*螺丝机","881008*电动扳手","881009*电剪刀","881010*磨刀机","881011*石材切割机","881012*型材切割机","881013*电动抛光机/光饰机/磨光机","881014*电磨/电动角磨机","881015*电动砂带机/砂光机","881016*电动雕刻机","881017*电动套丝机","881018*电动砂轮机","881019*电动倒角机","881020*电动坡口机","881021*套装电动工具","8810*其它电动工具"];
arrprodu1["0_88_11"]=["881101*气动铆钉枪","881102*气动扳手","881103*气动螺丝刀/气动起子","881104*气动锤","881105*气动钻","881106*气动锯","881107*气铲/气动铲","881108*气动锉","881109*气动捣固机","881110*气动胶枪","881111*气动打钉枪/气动打钉机","881112*气动振动器","881113*气动打磨机","8811*其它气动工具"];
arrprodu1["0_88_12"]=["881201*扳手","881202*套筒扳手组套","881203*钳子","881204*螺丝刀/ 改锥/螺丝起子","881205*工具刷","881206*手工剪","881207*锤子/榔头","881208*镊子","881209*锉","881210*斧子/斧头","881211*撬棍/撬杠/起钉器","881212*黄油枪","881214*丝锥/丝攻/牙攻","881215*板牙","881216*丝锥板牙套装","881217*丝锥板手","8812*其它手动工具"];
arrprodu1["0_88_16"]=["881601*气瓶","881602*回火防止器","881603*瓶阀","881604*减压器","881605*电焊钳","881606*电焊面罩/电焊面具","881607*电焊玻璃","881608*电焊手套","881609*电焊脚套","881610*焊炬/割炬/焊枪","881611*乙炔发生器","881612*喷灯","881613*焊条","881614*焊台","881615*变位机","881616*滚轮架","881617*操作机","881618*焊接小车","881619*送丝机","881620*焊接自动跟踪","881621*工装焊接夹具","881622*焊粉","8816*其它气焊器材/电焊器材"];
arrprodu1["0_88_60"]=["886001*抹泥板/抹泥刀","886002*油灰刀","886003*玻璃刀","886004*手工刨/刨子","8860*其它匠作工具"];
arrprodu1["0_88_65"]=["886501*拉铆枪","886502*台虎钳","886503*弯管器","886504*钢号码","886505*刮刀","886506*划线器","8865*其它钳工工具"];
arrprodu1["0_88_68"]=["886801*管钳","886802*绞刀","886803*管子割刀","886804*管子丝攻机","886805*电动切管机","886806*带压开孔器","886807*薄管工具","886808*卷管器","8868*其它管工工具"];
arrprodu1["0_88_70"]=["887001*紧线钳紧线器","887002*剥线钳","887003*压线钳/驳线钳","887004*冷压接钳","887005*电工刀","887006*测电器","887007*电缆钳","887008*断线钳","887009*电烙铁","8870*其它电工工具"];
arrprodu1["0_88_80"]=["888001*人造磨料","888002*天然磨料","8880*其它磨料"];

arrprodu1["0_89"]=["8910*监控设备","8920*防盗报警设备","8940*交通安全设施","8941*智能交通","8950*安检设备","8955*防伪识别","8960*门禁考勤/楼宇对讲","8970*公共广播系统"];
arrprodu1["0_89_10"]=["891001*监控摄像机","891002*智能球","891003*监控主机","891004*画面处理器","891005*矩阵","891006*解码器","891007*传输设备/传输系统","891008*监视器","891009*硬盘录像机","891010*监控器支架","891011*护罩/球罩","891012*云台","891013*镜头","891014*摄像机机芯","8910*其它监控设备"];
arrprodu1["0_89_20"]=["892001*集成防盗报警系统","892002*电话报警设备","892003*接警/报警主机","892004*报警器","892005*发射器/接收器","892006*防盗感应器/防盗探头","892007*警号/闪灯","892008*个人报警器","892009*防火门","892010*防盗门","892011*保险柜/保险箱","8920*其它防盗报警设备"];
arrprodu1["0_89_40"]=["894001*护栏/护栏网","894002*反光材料","894003*交通安全标志","894004*交通安全服装","894005*防撞设施","894006*路障","894007*道钉","894008*道路减速设备","894009*安全凸面镜","8940*其它交通安全设施"];
arrprodu1["0_89_41"]=["894101*智能停车场管理","894102*交通控制管理","894103*交通收费设备","894104*交通检测设备","894105*电子警察系统","894106*车载录像机/行驶记录仪","8941*其它智能交通"];
arrprodu1["0_89_50"]=["895001*安检探测器","895002*反偷拍/反窃听器材","895003*安检门/金属探测门","895004*身份证识别仪","8950*其它安检设备"];
arrprodu1["0_89_55"]=["895501*指纹识别仪","895502*人脸识别设备","8955*其它防伪识别"];
arrprodu1["0_89_60"]=["896001*射频卡","896002*IC卡","896003*磁卡","896004*条码卡","896005*门铃","896006*可视对讲","896007*非可视对讲","896008*门禁考勤控制设备","896009*门禁读卡器","896010*一卡通管理系统","896011*门禁考勤系统","896012*电子巡更系统","896013*闭门器/开门器","8960*其它门禁考勤/楼宇对讲"];
arrprodu1["0_89_70"]=["897001*功放","897002*音箱","897003*扬声器/喇叭","897004*音柱","897005*播放器","897006*放大器","897007*调节器","897008*话筒/传声器","8970*其它公共广播系统"];

arrprodu1["0_90"]=["9010*轴承","9020*刀具","9030*模具","9040*气动元件","9050*液压机械与元件","9060*机床","9061*机床附件","9066*五金加工机械","9070*振动器/振动装置","9080*内燃机","9090*金属材料热处理"];
arrprodu1["0_90_10"]=["901001*滚动轴承","901002*滑动轴承","901003*深沟球轴承","901004*滚针轴承","901005*直线运动轴承","901006*圆锥滚子轴承","901007*圆柱滚子轴承","901008*角接触球轴承","901009*调心滚子轴承","901010*外球面球轴承","901011*关节轴承","901012*推力球轴承","901013*轴承附属件","9010*其它轴承"];
arrprodu1["0_90_20"]=["902001*车刀","902002*铣刀","902003*铰刀","902004*钻头","902005*刨刀","902006*刀带","902007*镗刀","902008*拉刀","902009*切刀","902010*滚刀","902011*插齿刀/剃齿刀","902012*齿轮刀具","902013*螺纹刀具","902014*数控刀具/切削工具","902015*刀片","902016*锯片","902017*刀杆","902018*刀柄","902019*夹头","902020*冲头","902021*夹具","9020*其它刀具"];
arrprodu1["0_90_30"]=["903001*成型模","903002*塑料模","903003*橡胶模","903004*锻造模","903005*级进模/连续模","903006*模型/手板","903007*压铸模","903008*铸造模","903009*冲压模/冲裁模/冷冲模","903010*拉丝模","903011*冷镦模","903012*弯曲模","903013*拉深模","903014*复合模","903015*消失模","903016*硬质合金模","903017*粉末冶金模","903018*快速经济模","903019*冷冲模架","903020*塑料模架","903021*压铸模架","903022*冷却元件","903023*加热元件","903024*导向元件","903025*模具热流道系统","903026*模具修补机","903027*模具雕刻机","903028*模具强化机","903029*合模机","903030*模具标准件","9030*其它模具"];
arrprodu1["0_90_40"]=["904001*气缸","904002*气动接头","904003*快速接头","904004*金属接头","904005*气源处理器/气源处理件","904006*气动软管/PU软管","904007*气动阀","904008*气动马达/风动马达","9040*其它气动元件"];
arrprodu1["0_90_50"]=["905001*液压缸","905002*液压阀","905003*伺服阀","905004*液压接头","905006*液压系统","905007*液压泵","905008*液压马达","9050*其它液压机械与元件"];
arrprodu1["0_90_60"]=["906001*车床","906002*冲床","906003*铣床","906004*钻床","906005*镗床","906006*磨床","906007*锯床","906008*拉床","906009*刨床/插床","906010*锻压机床","906011*铸造机床","906012*木工机床","906013*齿轮加工机床","906014*螺纹加工机床","906015*加工中心/电脑锣","906016*数控机床","906017*组合机床","906018*电火花/线切割","906019*切边机","906020*电铸机","906021*制钉机","9060*其它机床"];
arrprodu1["0_90_61"]=["906102*卡盘","906103*工作台","906104*顶尖/顶针","906105*分度盘/分度头","906106*磁性分离器","906107*吸盘","906108*手轮","906109*手柄","906110*手柄套/手柄座","906111*拖链","906112*钻套","906113*皮带轮","906114*导轨","906116*冷却管","906117*机床刀架","906118*机床主轴","906119*机床接杆","906120*机床护罩","906121*防尘布","906122*机床垫铁","906123*机床减震装置","906124*润滑系统","906125*工装夹具","9061*其它机床附件"];
arrprodu1["0_90_66"]=["906601*金属拉丝机","9066*其它五金加工机械"];
arrprodu1["0_90_70"]=["907001*电磁振动器/电动振动器","907002*气动振动器","9070*其它振动器/振动装置"];
arrprodu1["0_90_80"]=["908001*柴油机","908002*汽油机","9080*其它内燃机"];
arrprodu1["0_90_90"]=["909001*淬火感应器","9090*其它金属材料热处理"];

arrprodu1["0_93"]=["9310*原料药机械及设备","9320*饮片机械","9330*制剂机械"];
arrprodu1["0_93_10"]=["931001*药用反应设备","931002*药用干燥设备","931003*药用结晶设备","931004*药用蒸发设备","931005*药用萃取设备","931006*药用蒸馏设备","931007*药用筛分机","931008*药用过滤设备","931009*药用离心机","931010*药用粉碎机","931011*药用研磨机","931012*烘道","9310*其它原料药机械及设备"];
arrprodu1["0_93_20"]=["932001*洗药机","932002*切药机","932003*润药机","932004*炒药机","932005*煎药机","9320*其它饮片机械"];
arrprodu1["0_93_30"]=["933001*制丸机/丸剂机械","933002*膏剂机械","933003*滴眼剂机械/眼药水灌装机","933004*栓剂机械","933005*硬胶囊剂机械","933006*软胶囊剂机械","933008*输液剂机械","933009*气雾剂机械","933010*口服液剂机械","933011*酊剂机械/糖浆剂机械","933012*药膜剂机械","933013*药用抛光机","933014*药用压片机","933015*药用包衣机","9330*制剂机械"];

arrprodu1["0_95"]=["9510*果蔬机械","9520*饮料设备","9525*乳品机械","9530*烘焙设备","9535*炊事设备","9540*饼干机械","9545*糖果机械","9550*屠宰机械","9555*肉加工设备","9560*米面机械","9561*粮食加工设备","9562*酿酒设备","9565*豆制品设备","9570*休闲食品加工设备","9580*调味品设备","9581*辣椒设备","9585*油脂设备","9590*茶叶设备/制茶设备"];
arrprodu1["0_95_10"]=["951001*选果机/捡果机","951002*洗果机","951003*果袋机","951004*网套机","951005*去核机","951006*去皮机/脱皮机/剥皮机","951007*洗菜机","951008*预煮机/漂烫机","951009*压榨机","951010*切菜机/果蔬切片机/切丝机","951011*果蔬打浆机","9510*其它果蔬机械"];
arrprodu1["0_95_20"]=["952001*冰淇淋剂机/冰激凌机","952002*棒棒冰机","952003*冷饮水箱","952004*沙冰机","952005*冰棒机/冰棍机/雪糕机","952006*雪泥机/雪粒机/雪融机/雪蓉机","952007*冷饮机","952008*刨冰机","952009*炒冰机","952010*果汁饮料设备","952011*茶饮料设备","952012*易拉罐灌装线","9520*其它饮料设备"];
arrprodu1["0_95_25"]=["952501*乳品生产线","952502*挤奶机","952503*净乳机/乳品分离机","952504*奶罐","952505*酸奶机","952506*乳制品发酵罐","9525*其它乳品机械"];
arrprodu1["0_95_30"]=["953001*烘炉","953002*烤箱","9530*其它烘焙设备"];
arrprodu1["0_95_35"]=["953501*蒸箱","953502*炊具","953503*炸锅","953504*烤禽炉","953505*电饼铛","9535*其它炊事设备"];
arrprodu1["0_95_40"]=["954001*饼干机","954002*饼干生产线","954003*糕点机","954004*月饼机","954005*雪饼机/米饼机","954006*蛋黄派机","954007*饼干包装机","9540*其它饼干机械"];
arrprodu1["0_95_45"]=["954501*糖果机","954502*糖果生产线","954503*硬糖机","954504*饴糖设备","954505*熬糖锅/蒸汽锅/化糖锅","954506*拌糖机","954507*巧克力机械","954508*糖果包装机","9545*其它糖果机械"];
arrprodu1["0_95_50"]=["955001*宰杀/屠宰流水线","955002*脱毛机","955003*切鱼机","955004*洗肚机","955005*浸烫机/浸烫机","955006*麻电机","955007*洗猪机","955008*屠宰输送机","9550*其它屠宰机械"];
arrprodu1["0_95_55"]=["955501*肉制品生产线","955502*切肉机","955503*绞肉机","955504*绞切机","955505*肉丸机/丸子机/鱼丸机","955506*肉丸打浆机","955507*拌馅机","955508*斩拌机","955509*锯骨机","955510*切肉片机","955511*嫩化机/嫩肉机/松肉机","955512*蒸熏炉","955513*香肠机","955514*灌肠机","955515*盐水注射机","955516*真空滚揉机","9555*其它肉加工设备"];
arrprodu1["0_95_60"]=["956001*和面机/拌面机","956002*面条机/压面机","956003*粉条机/粉丝机","956004*凉皮机/河粉机/面皮机","956005*米线机/米粉机","956006*挂面机","956007*包子机","956008*馒头机/方馒头机","956009*饺子机/水饺机","956010*春卷皮机","9560*其它米面机械"];
arrprodu1["0_95_61"]=["956101*碾米机","956102*脱壳机","956103*去石机","956105*面粉机/磨面机","956106*淀粉机","956107*大米加工设备","9561*其它粮食加工设备"];
arrprodu1["0_95_62"]=["956201*酿酒生产线","956202*白酒设备","956203*啤酒设备","956204*葡萄酒设备","956205*果酒设备","956206*扎啤机/啤酒售酒器","9562*其它酿酒设备"];
arrprodu1["0_95_65"]=["956501*豆腐机","956502*腐竹机/腐皮机","956503*豆皮机/百叶机/千张机","956504*磨浆机","956505*豆浆机","956506*豆奶机","956507*豆粉设备","9565*其它豆制品设备"];
arrprodu1["0_95_70"]=["957001*膨化机","957002*炒货机","957003*爆米花机","957004*棉花糖机","957005*烧烤机","957006*关东煮机","957007*炒板栗机","957008*煎饼机","957009*蛋卷机","957010*蛋筒机","957011*脆皮机","957012*麻花机","957013*桃酥机","957014*锅巴机","957015*烤肠机/热狗机","957016*烤玉米机","957017*面包机","957018*汉堡机","957019*薯片机","957020*薯条机","957021*果汁机","957022*榨汁机","957023*咖啡机","957024*奶茶机","957025*奶昔机","957026*鱿鱼丝机","957027*果冻机","9570*其它休闲食品加工设备"];
arrprodu1["0_95_80"]=["958001*酱油设备","958002*酿醋设备","958003*制盐设备","958004*味精设备","958005*调味品加工机械","958006*调味品包装机械","9580*其它调味品设备"];
arrprodu1["0_95_81"]=["958101*辣椒清洗设备","958102*辣椒去籽设备","958103*辣椒粉碎设备","9581*其它辣椒设备"];
arrprodu1["0_95_85"]=["958501*榨油机","958502*预榨机","958503*油脂成套设备","958504*浸出设备","9585*其它油脂设备"];
arrprodu1["0_95_90"]=["959001*采茶机","959002*摇青机","959003*杀青机","959004*揉捻机","959005*茶叶烘干机","959006*茶叶炒干机","959007*茶叶包装机","9590*其它茶叶设备/制茶设备"];

arrprodu1["0_98"]=["9810*工业废水","9811*疑难废水处理","9812*生活污水处理工程","9813*饮用水工程","9814*工业纯水","9815*给排水工程","9817*河道治理","9820*空气净化工程","9821*废气治理","9822*粉尘治理","9830*固废处理","9840*防腐工程","9850*节能工程","9860*绿化工程","9861*景观工程","9863*土壤修复","9870*噪声振动治理","9880*在线控制与监控"];
arrprodu1["0_98_10"]=["981001*养殖场污水处理/养殖场废水处理","981002*屠宰场污水处理/屠宰场废水处理","981003*制药污水处理/制药废水处理","981004*医院污水处理/医院废水处理","981005*餐饮污水处理/餐饮废水处理","981006*食品污水处理/食品废水处理","981007*酿造废水处理","981008*冶金废水处理/冶金污水处理","981009*电镀废水处理/电镀废水处理回用","981010*涂装废水处理/涂装污水处理","981011*线路板废水处理","981012*半导体业废水处理","981013*石化行业污水处理","981014*油田污水处理","981015*印染废水处理/印染污水处理","981016*皮革废水处理","981017*造纸污水处理/造纸废水处理","981018*洗车循环水处理","981019*电厂废水处理","981020*中央空调水处理","981021*污泥处理","981022*锅炉水处理","9810*其它工业废水处理设备"];
arrprodu1["0_98_11"]=["981101*重金属废水","981102*含酚废水","981103*酸碱废水","981104*含硫废水","981105*氨氮废水","9811*其它疑难废水处理设备"];
arrprodu1["0_98_12"]=["981201*中小城镇污水处理","981202*小区生活污水处理","981204*泳池/洗浴水处理","9812*其它生活污水处理工程"];
arrprodu1["0_98_13"]=["981301*自来水厂水处理工程","981302*直饮水工程","981303*农村饮用水工程","981304*井水处理/井水净化","981305*矿泉水项目","9813*其它饮用水工程"];
arrprodu1["0_98_14"]=["981401*电子工业纯水","981402*制药纯水","981403*锅炉补给水","981404*涂装纯水","981405*镀膜玻璃用水","981406*蓄电池用水","981407*食品工业用水","981408*软化水处理工程","981409*反渗透纯水处理","9814*其它工业纯水设备"];
arrprodu1["0_98_15"]=["981501*工业给排水工程","981502*建筑给排水","981503*给排水系统及管网","981504*打井","981505*水产养殖","981506*雨水工程","9815*其它给排水工程"];
arrprodu1["0_98_17"]=["981701*河道清淤工程","981702*河道疏浚工程","981703*河道生态治理","981704*人工湖水处理/人工湖水质净化","9817*其它河道治理工程"];
arrprodu1["0_98_20"]=["982001*手术室/病房空气净化","982002*实验室空气净化","982003*半导体空气净化","982004*光学仪器车间空气净化","982005*微电子车间净化","982006*食品车间空气净化","982007*通风工程","9820*其它空气净化工程"];
arrprodu1["0_98_21"]=["982101*烟气脱硫","982102*脱氮脱硝","982103*有机废气（酸雾）净化工程","982104*除臭工程","982105*餐饮油烟净化工程","982106*化工厂废气处理工程","982107*发性有机化合物废气治理工程","982108*大气污染防治工程","9821*其它废气处理工程"];
arrprodu1["0_98_22"]=["982201*木材加工粉尘治理","982202*选煤厂粉尘治理","982203*锅炉烟气除尘","982204*火电厂输煤系统粉尘治理","982205*打磨抛光粉尘治理工程","982206*涂装通风除尘工程","982207*喷砂除尘","982208*电解铝烟气净化","982209*耐火材料厂粉尘治理","982210*水泥工业粉尘治理","982211*喷雾除尘/喷雾降尘/水雾除尘","9822*其它粉尘治理"];
arrprodu1["0_98_30"]=["983001*医疗垃圾处理","983002*冶金工业固废处理/废物处理","983003*电厂固体废物处理","983004*矿业固体废物处理工程","983005*石油化学工业固体废物处理工程","983006*污泥处理工程","983007*放射性固体废物处理工程","983008*城市生活垃圾处理工程","983009*垃圾焚烧发电工程","983010*垃圾填埋工程","983011*垃圾生化处理/垃圾堆肥处理工程","983012*垃圾渗滤液处理","9830*其它固废处理工程"];
arrprodu1["0_98_40"]=["984001*环氧地坪/环氧树脂地坪/工业地坪工程","984002*桥梁防腐","984003*烟囱防腐","984004*罐体防腐","984005*金属构件防腐","984006*水池防腐工程","984007*防腐保温工程","984008*脱硫防腐工程","984009*玻璃钢防腐工程","9840*其它防腐工程"];
arrprodu1["0_98_50"]=["985001*建筑节能工程","985002*绿色照明工程","985003*余热余压利用工程","985004*太阳能工程","985005*太阳能热水工程","985006*太阳能路灯工程","985007*太阳能电站/光伏电站","985008*风力发电厂/风力发电站","9850*其它节能工程"];
arrprodu1["0_98_60"]=["986001*城区公共绿化","986002*道路绿化","986003*桥梁绿化","986004*花坛","986005*绿化带","986006*校园绿化/厂区绿化","986007*屋顶绿化","9860*其它绿化工程"];
arrprodu1["0_98_61"]=["986101*公园景观","986102*景区景观工程","986103*住宅小区景观","986104*别墅景观工程","986105*河道景观工程","986106*照明景观工程","986107*大型广场景观","986108*假山喷泉工程","986109*庭院景观","986110*公共环境景观/办公环境景观","986111*景观水处理工程","9861*其它景观工程"];
arrprodu1["0_98_63"]=["9863*其它土壤修复"];

arrprodu1["0_98_70"]=["987001*空压机噪声治理","987002*冷却塔噪声治理","987003*空调机组噪声控制","987004*交通噪声治理","987005*电机噪声治理","987006*锅炉房噪声治理","987007*水泵噪声治理","9870*其它噪声振动治理"];
arrprodu1["0_98_80"]=["988001*污水排放监测","988002*烟气脱硫在线监测系统","988003*环境监控信息系统","988004*水质在线自动监测系统","9880*其它环境在线控制与监控"];
arrprodu1["0_99"]=["9910*维修/安装服务","9920*企业日常服务","9930*机械五金加工服务","9970*代理加盟","9980*设备租赁","9990*二手设备转让"];
arrprodu1["0_99_10"]=["991001*仪器仪表维修安装","991002*工控设备维修安装","991003*电子产品维修安装","991004*电工电器维修安装","991005*机械设备维修安装","991006*包装印刷设备维修安装","991007*五金工具维修安装 ","9910*其它维修/安装服务"];
arrprodu1["0_99_20"]=["992001*清洗清洁服务","992002*环境评价服务","992003*能源托管","9920*其它企业日常服务"];
arrprodu1["0_99_30"]=["993001*机加工","993002*铸造加工","993003*冲压加工","993004*五金加工","993005*焊接加工","993006*钣金加工","993007*锻造加工","993008*激光加工","993009*模具制造加工","993010*表面处理加工","993011*雕刻打号加工","993012*粉末冶金加工","9930*其它机械五金加工服务"];
arrprodu1["0_99_70"]=["997001*环保设备代理加盟","997002*仪器仪表代理加盟","997003*工控设备代理加盟","997004*电工电气代理加盟","997005*电子加工设备代理加盟","997006*农业园林机械代理加盟","997007*化工设备代理加盟","997008*精细化学品代理加盟","997009*矿冶设备代理加盟","997010*物流设备代理加盟","997011*安防设备代理加盟","997012*五金工具代理加盟","997013*照明器材代理加盟","997014*印刷设备代理加盟","997015*包装设备代理加盟","997016*食品机械代理加盟","9970*其它代理加盟"];
arrprodu1["0_99_80"]=["998001*环保设备租赁","998002*仪器仪表租赁","998003*工控设备租赁","998004*电工电气产品租赁","998005*电子加工设备租赁","998006*化工设备租赁","998007*锅炉租赁","998008*物流设备租赁","998009*矿冶设备租赁 ","998010*照明器材租赁 ","998011*机床租赁","998013*工程机械租赁","998014*木工机械租赁","998015*食品机械租赁","998016*农业机械租赁","998017*包装机械租赁","998018*清洗设备租赁","998019*印刷设备租赁","998020*塑料机械租赁","998021*橡胶加工设备租赁","998023*造纸设备租赁","998024*制药设备租赁","998025*安防产品租赁","998026*五金工具租赁","9980*其它设备租赁服务"];
arrprodu1["0_99_90"]=["999001*二手环保设备","999002*二手仪器仪表","999003*二手工控设备","999004*二手电工电气产品","999005*二手电子加工设备","999006*二手化工设备","999007*二手锅炉","999008*二手物流设备","999009*二手矿冶设备","999010*二手照明器材 ","999011*二手机床","999012*二手通用零部件","999013*二手工程机械","999014*二手木工机械","999015*二手食品机械","999016*二手农业机械","999017*二手包装机械","999018*二手清洗设备","999019*二手印刷设备","999020*二手塑料机械","999021*二手橡胶加工设备","999023*二手造纸设备","999024*二手制药设备","999025*二手化工设备","999026*二手安防产品","999027*二手五金工具","9990*其它二手设备转让"];

var dsy=new Dsy();
function arrayJoin(a1,a2){//数组合并 a2数组合并到a1中，重复删除
	var flag;
	if(a1==null) return a2;
	if(a2==null&&a1==null) return null;
	for(var i=0;i<a2.length;i++){
		flag=false;
		for(var x=0;x<a1.length;x++){
			if(a1[x]==a2[i]){ flag=true;continue;}
		}
		if(!flag) a1[a1.length]=a2[i];
	}
	return a1;
}
function getSecondCate(keyword){//反向筛选
	var secondCate=new Array();
	secondCate.length=0;
	for(var i in arrprodu1){
		if(i.length>4){
			for(var y=0;y<arrprodu1[i].length;y++){
				var cateinfo=arrprodu1[i][y].split("*");
				var catedetail=cateinfo[1].split("/");
				if(keyword.indexOf(cateinfo[1])>-1||keyword.indexOf(catedetail[0])>-1||keyword.indexOf(catedetail[2])>-1){
					secondCate.push(cateinfo[0]+"*"+cateinfo[1]);
				}
			}
		}
	}
	//alert(secondCate.join(","));
	return secondCate;
}

productstring1="";
productstring2="";
productstring3="";
productstringall="除尘";
for(var i in arrprodu1){
	dsy.add(i,arrprodu1[i]);
	if(i.length>4)productstring3+=arrprodu1[i].join("");
	else if (i.length==4)
	{
		productstring2+=arrprodu1[i].join("");
	}
	productstringall+=arrprodu1[i].join("");
}
productstringall+="器";
function showprodcatname(id){
	if (typeof spcdsy=='undefined'){
		spcdsy=new Dsy();
		for(var i in arrprodu1){
			for(var j in arrprodu1[i]){
				var tmpdataarr=arrprodu1[i][j].split("*");
				spcdsy.add(tmpdataarr[0],tmpdataarr[1]);
			}
		}
	}
	if(typeof (spcdsy.Items[id])=="undefined")return id;
	else return spcdsy.Items[id].replace("其他","").replace("其它","");
}

function killErrors() {
return true;
}
window.onerror =killErrors;
var productstring1=arrprodu1["0"].join("");
productstring1+="12";
productstring2+="1234";


function changeinput(elementx)
{
	var elementxx=document.getElementById(elementx).value;
	var reg=/[\D\s]/;
	if(!reg.exec(elementxx)){$("#searchdiv").hide();return false;}
	var reg46 = new RegExp("\\d{4,6}\\*\\D*"+elementxx+"\\D*","ig");
	var rsarr=new Array;
	var displayarr=new Array;
	rsarr.length=0;
	rsarr=productstring3.match(reg46);
	rsarr=arrayJoin(rsarr,getSecondCate(elementxx));
	
	arrlen = rsarr.length;
	innerH="";
	for(i=0;i<arrlen;i++){
		datax=rsarr[i].split("*");
		
		r1_4=datax[0].substr(0, 4);
		//if(r1_4==9910) continue;
		r1_2=datax[0].substr(0, 2);
		r1=datax[0].substr(0, 1);
		r3=datax[0].substr(2, 1);

		var reg1 = new RegExp(r1_4+"\\*[\\W\\w]*","i");
		var reg2 = new RegExp(r1_2+"\\*[\\W\\w]*","i");
		rspa2=productstring2.match(reg1);
		rspa1=productstring1.match(reg2);
		arr1=rspa2[0].split("*");
		rspa2text=arr1[1].slice(0,-4);
		arr1=rspa1[0].split("*");
		rspa1text=arr1[1].slice(0,-2);
	
		if(datax[0]<10000){
		}else{
			r5_6=datax[0].substr(4, 2);
		}
		innerH+="<span id=listspan onmouseover=this.style.background='#ceebff' onmouseout=this.style.background=''><a href='#' onclick=javascript:displayselect();update1('"+rspa1text+"▲"+rspa2text+"▲"+datax[1]+"')"+">&nbsp;"+rspa1text+"  >>  "+rspa2text+"  >>  "+datax[1]+"</a></span>";
	}
	if(!innerH)document.getElementById("searchdiv").style.display='none';
	
	if(document.getElementById("s1")) document.getElementById("s1").style.visibility="hidden";
	if(document.getElementById("s2")) document.getElementById("s2").style.visibility="hidden";
	if(document.getElementById("s3")) document.getElementById("s3").style.visibility="hidden";
	if(document.getElementById("sid")) document.getElementById("sid").style.visibility="hidden";
	if(document.getElementById("danwei")) document.getElementById("danwei").style.visibility="hidden";
	document.getElementById("searchdiv").innerHTML=innerH;
	hiddenblur('searchdiv','visible');

}

function txtlength_sy(){
	if(document.getElementById("kind").checked==true){
		var txt=document.getElementById("product_name").value;
		document.getElementById('searchdiv').style.display=''
		if(txt.length>1){
			changeinput_sy("product_name");
		}else if(txt.length<=1){
			document.getElementById("searchdiv").style.display='none';
		}
	}
}
function txtlength_sy2(){

		var txt=document.getElementById("product_name").value;
		if(txt=="查找产品  请输入关键字") return false;
		//document.getElementById('searchdiv').style.display=''
		if(txt.length>0){
			changeinput_sy("product_name");
		}else if(txt.length<1){
			document.getElementById("searchdiv").style.display='none';
		}
}
function txtlength_company(){

		var txt=document.getElementById("company_id").value;
		if(txt=="查找产品  请输入关键字") return false;
		document.getElementById('searchdiv2').style.display=''
		if(txt.length>0){
			changeinput_company("company_id");
		}else if(txt.length<1){
			document.getElementById("searchdiv2").style.display='none';
		}
}
function changeinput_company(elementx)
{
	changeinput_new(elementx);
	/*var elementxx=document.getElementById(elementx).value;
	var reg=/[\D\s]/;
	if(!reg.exec(elementxx)){$("#searchdiv").hide();return false;}
	var reg46 = new RegExp("\\d{4,6}\\*\\D*"+elementxx+"\\D*","ig");
	var rsarr=new Array;
	var displayarr=new Array;
	rsarr.length=0;
	rsarr=productstring3.match(reg46);
	rsarr=arrayJoin(rsarr,getSecondCate(elementxx));
	try{
		arrlen = rsarr.length;
		innerH="";
		for(i=0;i<arrlen;i++){
			datax=rsarr[i].split("*");
			r1_4=datax[0].substr(0, 4);
			if(r1_4==9910) continue;
			r1_2=datax[0].substr(0, 2);
			r1=datax[0].substr(0, 1);
			r3=datax[0].substr(2, 1);
	
			var reg1 = new RegExp(r1_4+"\\*[\\W\\w]*","i");
			var reg2 = new RegExp(r1_2+"\\*[\\W\\w]*","i");
			rspa2=productstring2.match(reg1);
			rspa1=productstring1.match(reg2);
			arr1=rspa2[0].split("*");
			rspa2text=arr1[1].slice(0,-4);
			arr1=rspa1[0].split("*");
			rspa1text=arr1[1].slice(0,-2);
		
			if(datax[0]<10000){
			}else{
				r5_6=datax[0].substr(4, 2);
			}
			innerH+="<span id=listspan onmouseover=this.style.background='#ceebff' onmouseout=this.style.background='' onkeydown='sy_keydown()'><a href='http://www.goepe.com/search/search.php?catid="+datax[0]+"&keyword="+elementxx+"&from=company' target='_blank'>&nbsp;"+rspa2text+"&nbsp;<font style='color:#666666'>>></font>&nbsp;"+datax[1]+"</a></span>";
		}
		document.getElementById("searchdiv2").innerHTML=innerH;
		if(!innerH)document.getElementById("searchdiv2").style.display='none';
	}catch(err){document.getElementById("searchdiv2").style.display='none';}
	//arrlen = rsarr.length < 10 ? rsarr.length:10;
	hiddenblur('searchdiv2','visible');
*/
}
function changeinput_new(elementx){
	var elementxx=document.getElementById(elementx).value;
	$.ajax({
			url:ajaxurl("member","prod_sort_kwd"),
			type:"post",
			dataType:"json",
			data:{kwd:elementxx,v:Math.random()},
			success:function(data, textStatus){
				var innerH="";
				if(data.ok==1){
					if(elementxx!=document.getElementById(elementx).value) return ;
					for(var i=0;i<data.cat.length;i++){
						innerH+="<span id=listspan onmouseover=this.style.background='#ceebff' onmouseout=this.style.background='' onkeydown='sy_keydown()'><a href='http://www.goepe.com/search/search.php?catid="+data.cat[i].id+"&keyword="+elementxx+"'  target='_blank' onclick='getkeyword(this)' onmouseover='javascript:$(this).focus()'>&nbsp;"+showprodcatname(data.cat[i].id.substr(0,2))+"&nbsp;<font style='color:#666666'>>></font>&nbsp;"+data.cat[i].name+"</a></span>";
					}
					document.getElementById("searchdiv").innerHTML=innerH;
					document.getElementById("searchdiv").style.display='block';
					if(!innerH)document.getElementById("searchdiv").style.display='none';
					hiddenblur('searchdiv','visible');
				}
			},
			error:function(XMLHttpRequest, textStatus, errorThrown){
				//alert("操作失败，请重试！");
			}
			
		});	
}
function changeinput_sy(elementx)
{
	changeinput_new(elementx);
	/*var elementxx=document.getElementById(elementx).value;
	var reg=/[\D\s]/;
	if(!reg.exec(elementxx)){$("#searchdiv").hide();return false;}
	var reg46 = new RegExp("\\d{4,6}\\*\\D*"+elementxx+"\\D*","ig");
	var rsarr=new Array;
	var displayarr=new Array;
	rsarr.length=0;
	rsarr=productstring3.match(reg46);
	
	rsarr=arrayJoin(rsarr,getSecondCate(elementxx));
	//alert(rsarr.join(","));
	try{
		arrlen = rsarr.length;
		innerH="";
		for(i=0;i<arrlen;i++){
			datax=rsarr[i].split("*");
			r1_4=datax[0].substr(0, 4);
			if(r1_4==9910) continue;
			r1_2=datax[0].substr(0, 2);
			r1=datax[0].substr(0, 1);
			r3=datax[0].substr(2, 1);
	
			var reg1 = new RegExp(r1_4+"\\*[\\W\\w]*","i");
			var reg2 = new RegExp(r1_2+"\\*[\\W\\w]*","i");
			rspa2=productstring2.match(reg1);
			rspa1=productstring1.match(reg2);
			arr1=rspa2[0].split("*");
			rspa2text=arr1[1].slice(0,-4);
			arr1=rspa1[0].split("*");
			rspa1text=arr1[1].slice(0,-2);
		
			if(datax[0]<10000){
			}else{
				r5_6=datax[0].substr(4, 2);
			}
			innerH+="<span id=listspan onmouseover=this.style.background='#ceebff' onmouseout=this.style.background='' onkeydown='sy_keydown()'><a href='http://www.goepe.com/search/search.php?catid="+datax[0]+"&keyword="+elementxx+"'  target='_blank' onclick='getkeyword(this)' onmouseover='javascript:$(this).focus()'>&nbsp;"+rspa2text+"&nbsp;<font style='color:#666666'>>></font>&nbsp;"+datax[1]+"</a></span>";
		}
		document.getElementById("searchdiv").innerHTML=innerH;
		document.getElementById("searchdiv").style.display='block';
		if(!innerH)document.getElementById("searchdiv").style.display='none';
	}catch(err){document.getElementById("searchdiv").style.display='none';}
	//arrlen = rsarr.length < 10 ? rsarr.length:10;
	hiddenblur('searchdiv','visible');*/

}
function getkeyword(self){
	var keyword=$(self).attr("href").split("keyword");	
	$(self).attr("href",keyword[0]+"keyword="+$("#product_name").attr("value"));
}

//span上下键事件
function sy_keydown(){ 
	if(!document.getElementById("searchdiv")){
		return;
	}
	var rowsArray = document.getElementById("searchdiv").getElementsByTagName("span");
	
	
	
	
	 var allbg=true;
	 for(var i=0;i<rowsArray.length;i++){
		 if(rowsArray[i].style.backgroundColor=='#ceebff') allbg=false;
	 }
	 if(window.event.keyCode==38||window.event.keyCode==40){
		 if(allbg){
			rowsArray[0].style.backgroundColor = '#ceebff';
			rowsArray[0].onmouseover();
			return false;
		 }
	 }
	if(window.event.keyCode==38||window.event.keyCode==40||window.event.keyCode==13){
		for(var i=0;i<rowsArray.length;i++){  
			if(rowsArray[i].style.background=='#ceebff'){  
				switch(window.event.keyCode){  
					case 38 :
						if(i-1>=0){  
							rowsArray[i-1].style.background = '#ceebff';   
							rowsArray[i].style.background = '';  
						}
						if(i==0){
							rowsArray[i].style.background = '';
							i=rowsArray.length;
							rowsArray[i-1].style.background = '#ceebff';
						}
						break;  
					case 40 :  
						if(i+1<=rowsArray.length-1){  
							rowsArray[i+1].style.background = '#ceebff';    
							rowsArray[i].style.background = '';  
						}
						break;
					case 13 :
						if(allbg){
							
						}else{
							window.location.href=rowsArray[i].getElementsByTagName("a")[0].getAttribute("href");
							document.getElementById("formsearch").onsubmit=function(){
								return false;
							}	
						}
					break;
				}  
				break;  
			}
		}
	}
	
} 





function displayselect(){
	if(document.getElementById("s1")) document.getElementById("s1").style.visibility="";
	if(document.getElementById("s2")) document.getElementById("s2").style.visibility="";
	if(document.getElementById("s3")) document.getElementById("s3").style.visibility="";
	if(document.getElementById("sid")) document.getElementById("sid").style.visibility="";
	if(document.getElementById("danwei")) document.getElementById("danwei").style.visibility="";
}



function hiddenblur(idx,visible){
	document.getElementById(idx).style.visibility=visible;
}


function searchop(Selectx,ItemxText){
	var sx=document.getElementById(Selectx);
	for(var i=0;i<sx.options.length;i++)
	{
		newstr=sx.options[i].text;
		if(newstr==ItemxText){
			sx.options[i].selected = true;
			hiddenblur('searchdiv','hidden');
			break;
		}
	}
}

function update1(datax)
{

	datax=datax.split("▲");
	for(ii=1;ii<4;ii++){
		searchop("s"+ii,datax[ii-1]);
		change(ii);
	}
}

function Jsy()
{
 this.Items = {};
}
Jsy.prototype.add = function(id,iArray)
{
 this.Items[id] = iArray;
}
Jsy.prototype.Exists = function(id)
{
 if(typeof(this.Items[id]) == "undefined") return false;
 return true;
}
function change1(v,cat1,cat2){

 var str="0";
 for(i=0;i<v;i++){ str+=("_"+(document.getElementById(s[i]).selectedIndex-1));};
 var ss=document.getElementById(s[v]);
 with(ss){
  length = 0;
  options[0]=new Option(opt0[v],opt0[v]);

  if(typeof(opt1) == "undefined"){

  }else{
   var ss;
   var currentdata;
   currentdata=opt1[v];
   ss=currentdata.split("*");
   options[0]=Option(ss[1],ss[0]);

  }
  
  if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v)
  {
   if(jsy.Exists(str)){
    var ss;
	var currentdata;
    ar = jsy.Items[str];
    for(i=0;i<ar.length;i++){
	currentdata=ar[i];
	ss=currentdata.split("*");
	options[length]=new Option(ss[1],ss[0]);
	//alert(ss[0]);
	if(cat1==ss[0] || cat2==ss[0]){
	options[i+1].selected = true;
	}
	 
	
    //if(v)options[1].selected = true;
   //ss=arr.split("*")
   }
   }
   }
  if(++v<s.length){change1(v,cat1,cat2);}
   }
}
var jsy = new Jsy();
jsy.add("0",["10*水","30*气","40*固废","41*环卫","50*监测","60*噪声","70*新能源","80*防腐","99*环保知识库"]);
jsy.add("0_0",["1010*城镇供水","1011*石油化工","1012*食品饮料","1013*电子半导体","1014*制药","1015*电力钢铁","1016*纺织印染","1017*市政污水","1018*生活饮用水","1019*海水淡化","1020*泳池/洗浴水处理","1021*皮革","1022*造纸印刷","1023*机械加工","1024*消毒","1025*电镀废水","1026*医院","1027*实验室","1028*养殖业"]);
jsy.add("0_1",["3010*石化","3011*水泥厂","3012*锅炉","3013*火电/焦化厂","3014*汽车尾气处理","3015*垃圾场","3016*钢铁冶金","3017*装修污染","3018*餐饮业","3019*喷涂","3020*矿山煤场","3021*车间粉尘","3022*医院医药","3023*实验室洁净车间"]);
jsy.add("0_2",["4010*医疗废物","4011*工业固废","4012*生活垃圾","4013*危险废物厂"]);
jsy.add("0_3",["4110*环卫清洁"]);
jsy.add("0_4",["5010*水监测","5011*大气监测","5012*噪声监测","5013*固废监测","5014*故障报警","5015*物理特性","5016*实验试验"]);
jsy.add("0_5",["6010*交通噪声","6011*工业生产","6012*生活娱乐"]);
jsy.add("0_6",["7010*风力发电","7020*太阳能","7030*沼气发电","7040*地热","7050*生物质能"]);
jsy.add("0_7",["8010*高空路桥","8020*车间设备"]);
jsy.add("0_8",["9910*名词解释","9911*工作原理","9920*常识","9930*环保新技术"]);


function Nsy()
{
 this.Items = {};
}
Nsy.prototype.add = function(id,iArray)
{
 this.Items[id] = iArray;
}
Nsy.prototype.Exists = function(id)
{
 if(typeof(this.Items[id]) == "undefined") return false;
 return true;
}
function change2(v,cat1,cat2){

 var str="0";
 for(i=0;i<v;i++){ str+=("_"+(document.getElementById(s[i]).selectedIndex-1));};
 var ss=document.getElementById(s[v]);
 with(ss){
  length = 0;
  options[0]=new Option(opt0[v],opt0[v]);

  if(typeof(opt1) == "undefined"){

  }else{
   var ss;
   var currentdata;
   currentdata=opt1[v];
   ss=currentdata.split("*");
   options[0]=Option(ss[1],ss[0]);

  }
  
  if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v)
  {
   if(nsy.Exists(str)){
    var ss;
	var currentdata;
    ar = nsy.Items[str];
    for(i=0;i<ar.length;i++){
	currentdata=ar[i];
	ss=currentdata.split("*");
	options[length]=new Option(ss[1],ss[0]);
	//alert(ss[0]);
	if(cat1==ss[0] || cat2==ss[0]){
	options[i+1].selected = true;
	}

    //if(v)options[1].selected = true;
   //ss=arr.split("*")
   }
   }
   }
  if(++v<s.length){change2(v,cat1,cat2);}
   }
}
var nsy = new Nsy();
nsy.add("0",["10*企业新闻","11*工程招标","20*公益","30*生态","40*旅游","50*人物","60*访谈","70*科技","80*体育","90*娱乐","91*财经","92*汽车","93*装修","94*资源再生","95*污染防治","96*政策法规","97*行业分析"]);
nsy.add("0_0",["1010*战略合作","1020*技术革新","1031*培训讲座","1040*新上项目","1050*招标投标","1060*公司活动","1070*代理招商","1080*特价促销"]);
nsy.add("0_1",["1110*最新项目","1120*招标代理机构","1130*拟建项目","1140*招商引资"]);
nsy.add("0_2",["2010*公益人物","2020*公益行动","2030*明星公益","2040*NGO","2050*志愿者"]);
nsy.add("0_3",["3010*气候变化","3020*水资源","3030*湿地","3040*动植物保护","3050*农村生态环境"]);
nsy.add("0_4",["4010*山","4020*海","4030*江","4040*湖","4050*河","4060*瀑","4070*泉","4080*溪流","4081*主题公园","4082*人文景观","4090*其他自然景观旅游圣地"]);
nsy.add("0_5",["5010*政府部门","5020*企业工程技术","5030*志愿者","5040*其他环保人物"]);
nsy.add("0_6",["6030*人物访谈"]);
nsy.add("0_7",["7010*节能","7020*节水","7030*风力发电","7040*太阳能","7050*地热","7060*生物质能","7070*核能"]);
nsy.add("0_8",["8010*环保体育"]);
nsy.add("0_9",["9010*娱乐环保"]);
nsy.add("0_10",["9110*财经环保"]);
nsy.add("0_11",["9210*能源技术","9220*尾气污染控制","9230*内饰"]);
nsy.add("0_12",["9310*材料","9320*施工","9330*检测","9340*净化"]);
nsy.add("0_13",["9410*水资源","9420*废金属","9430*废塑料","9440*废橡胶","9450*纺织废料","9460*废纸","9470*其他资源再生利用技术"]);
nsy.add("0_14",["9510*大气污染防治","9519*生活城市污水","9520*河流污染防治","9530*地下水污染防治","9540*噪声污染防治","9550*辐射污染防治"]);
nsy.add("0_15",["9610*行政法规","9620*科技标准","9630*环境评价","9640*排污征费"]);
nsy.add("0_16",["9709*行业动态","9710*行业现状","9720*行业前景","9730*机遇挑战"]);